{
  "Title": "CodeCamp Iasi, April 23 2016",
  "Description": "CodeCamp is Probably the largest IT conference in Romania!. It started in 2009 and aims for better communication among the IT people.",
  "ShortName": "CodeCamp Iasi, April 23 2016",
  "StartDate": "2016-04-23T07:00:00+0200",
  "EndDate": "2016-04-23T18:00:00+0200",
  "Location": {
    "Id": 1,
    "Name": "Hotel International, Palas, Iasi",
    "Notes": "Hotel International, Palas, Strada Palat 5A, Iași, 700032, Romania",
    "Latitude": 47.154787,
    "Longitude": 27.586702,
    "City": "Iasi"},"Tracks":[{"Id":1,"_code":"track1","Name":"Room 1","Notes":"(150 seats, floor -2)"},{"Id":2,"_code":"track2","Name":"Room 2","Notes":"(250 seats, floor -2)"},{"Id":3,"_code":"track3","Name":"Room 3","Notes":"(150 seats, floor -2)"},{"Id":4,"_code":"track4","Name":"Room 4","Notes":"(30 seats, floor -2)"},{"Id":5,"_code":"track5","Name":"Room 5 (Track: Design)","Notes":"(30 seats, floor -2)"},{"Id":6,"_code":"track6","Name":"Room 6","Notes":"(30 seats, floor -1)"},{"Id":7,"_code":"track7","Name":"Room 7 (Track: Idea. Product. Business.)","Notes":"(30 seats, floor -1)"},{"Id":8,"_code":"track8","Name":"Room 8 (Track: Front-end)","Notes":"(40 seats, floor 0)"},{"Id":9,"_code":"track9","Name":"Room 9","Notes":"(50 seats, floor 1)"},{"Id":10,"_code":"track10","Name":"Room 10 (Track: QA)","Notes":"(100 seats, floor 11)"},{"Id":11,"_code":"track11","Name":"Room 11 (Track: BA/PM)","Notes":"(60 seats, floor 11)"}],"Speakers":[{"Id":1,"Name":"saher sidhom","Title":"Founder and CEO ","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/saher.sidhom.png","CompanyName":"HACKMASTERS","CompanyUrl":"http://hackmasters.co.uk","Bio":"Described by The Independent as a ‘business futurist”, Saher set up Hackmasters, a technology and innovation accelerator, with a simple principle: Speed is Good. This was borne out of the need for companies, large and small, to be set up and built to match their speed of growth with the speed of development of the new technologies that will drive that growth in their immediate future.","FirstName":"saher","LastName":"sidhom","Code":84},{"Id":2,"Name":"Ina Bagociute","Title":"Co-Founder and Innovation Director","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/ina.bagociute.jpg","CompanyName":"HACKMASTERS","CompanyUrl":"http://hackmasters.co.uk","Bio":"Ina is an award-winning innovation designer with experience in product, service and systems design. She was the Creative Director of FORGE at AMV with Saher and is a veteran hackmaster who co-directed all of the hack weeks with Saher in the last three years. Ina holds an MEng in Design and Innovation from Queen Mary and Goldsmiths Colleges, University of London.","FirstName":"Ina","LastName":"Bagociute","Code":84},{"Id":3,"Name":"Ross Ambrose","Title":"Innovation Director","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/ross.ambrose.jpg","CompanyName":"HACKMASTERS","CompanyUrl":"http://hackmasters.co.uk","Bio":"Ross Ambrose is a Masters graduate of Design and Innovation, a degree programme which focusses on the processes and research methods which lead to truly innovative design. His experience working for a number startups in London has tested and proven the value of his approach to both practical and complex problems.","FirstName":"Ross","LastName":"Ambrose","Code":84},{"Id":4,"Name":"Mircea Pricop","Title":"Software Engineer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/mircea.pricop.jpg","CompanyName":"Google","CompanyUrl":"http://www.google.com","Bio":"After starting my studies in Iasi and finishing them in Hamburg, I joined Google fresh off the benches of the university. Having been here for three years now, I'm currently focusing on information extraction, aggregation and data understanding as part of developing exciting new search features.","FirstName":"Mircea","LastName":"Pricop","Code":84},{"Id":5,"Name":"Sorin Peste","Title":"Technical Evangelist, Microsoft Romania","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/sorin.peste.jpg","CompanyName":"Microsoft","CompanyUrl":"http://www.microsoft.ro","Bio":"Sorin has been a part of the Enterprise Services unit within Microsoft Romania since 2011, and has been busy developing software on the Microsoft technology stack since 2001. Last year has taken on the Technical Evangelist role and will engage more actively with developers and IT Professionals, showcasing the newest Microsoft solutions and technology.<br/><br/>In his current role as well as previous ones, he has been part of delivering a number of enterprise solutions, both on premises and in the cloud. <br/><br/>Sorin likes coding, travelling and riding his motorcycle in his spare time. ","FirstName":"Sorin","LastName":"Peste","Code":84},{"Id":6,"Name":"Mihai Alexandru Bîrsan","Title":"Software Development Manager","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/mihai.birsan.jpg","CompanyName":"Amazon","CompanyUrl":"http://www.amazon.com","Bio":"Passionate about front-end technologies and the web. Codes by night, manages brilliant engineers by day. Still believes boring problems should be automated away through coding. Looks for interesting problems to solve with other skills.","FirstName":"Mihai","LastName":"Alexandru Bîrsan","Code":84},{"Id":7,"Name":"Marius Ursache","Title":"Co-founder & CEO Eternime / DE Toolbox","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/Marius_Ursache-100.png","CompanyName":"","CompanyUrl":"","Bio":"Marius is a teaching fellow and mentor for the MIT Global Entrepreneurship Bootcamp, and other accelerators and entrepreneurship programs in US, Chile, South Korea, Bulgaria and Romania. He is also co-founder & CEO of two companies: Eternime (an online platform for preserving people’s memories using AI avatars) and Disciplined Entrepreneurship Toolbox (a tool used by 5,000 startups and universities worldwide, including MIT, Harvard, and University of Houston). Previously Marius co-founded and managed Grapefruit, a UX and digital product development agency. <br/><br/>His background is very diverse, spanning variate skills (consulting, branding, UX, product development, Artificial Intelligence & chatbots) mainly for IT, healthcare and financial industries. Marius holds a Medical Doctor degree, a MSc in Digital Multimedia and various other certifications. When he needs a break from being this know-all-do-all person, he usually travels to remote tribal areas or to North Korea.","FirstName":"Marius","LastName":"Ursache","Code":84},{"Id":8,"Name":"Radu Marinescu","Title":"Group Manager for Code Quality","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/radu.marinescu.jpg","CompanyName":"Endava","CompanyUrl":"http://www.endava.com","Bio":"Radu Marinescu is Group Manager for Code Quality at Endava, where he aims to make code quality part of Endava’s organisational DNA. He is also professor of software engineering at the Politehnica University of Timisoara, where he heads the LOOSE Research Group.  Radu’s interests are focused on software design, quality assurance, software metrics and refactoring. He is co-author of the “Object-Oriented Metrics in Practice” book, one of the best selling titles on metrics.<br/><br/>Radu strongly believes that research must ultimately flow into software products that have influence the state of the practice in software companies. Consequently, he was one of the key driving forces in creating inFusion, an industry-strength tool for assessing design quality. inFusion has been successfully used by thousands of developers and architects in large-scale companies, including a very successful deployment in a Global Fortune 500 telecom company. In 2014 he received the ICSME Most Influential Paper Award, after having received in 2009, along with an MIT professor, the IBM John Backus Award for “having done the most to improve programmer productivity” from a jury that included two Turing Award winners. In 2010 he served as General Chair for the 26th International Conference on Software Maintenance, the premier scientific event in this field.","FirstName":"Radu","LastName":"Marinescu","Code":84},{"Id":9,"Name":"Thomas Behrens","Title":"Group Head of Analysis at Endava","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/thomas.behrens.png","CompanyName":"","CompanyUrl":"","Bio":"Thomas has held different positions and roles in the software development life cycle for various organisations over the past 25 years since having earned his degree in computer science. He worked in the domains of investment banking, telecommunications, mobile payments and embedded systems. Over the past two years, he focused on setting up distributed software development teams mainly in agile contexts and shaping the business analyst force at Endava. Thomas delivers training and speaks at conferences on topics related to requirements engineering.","FirstName":"Thomas","LastName":"Behrens","Code":84},{"Id":10,"Name":"Vlad \"Reign\" Zelinschi","Title":"UI Tech Lead, ATG Member","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/vlad.zelinschi.reign.jpg","CompanyName":"","CompanyUrl":"","Bio":"Vlad (close friends call him Reign :D) is a Frontend Engineer with a strong passion for the latest technologies out there and an unhealthy obsession for clean and simple code. He loves to try out things as soon as they hit the market so he always keeps an eye out for the JS, CSS and HTML ever-changing landscapes. He happily embraces any challenge, though he’ll prefer the ones related to React, Flux, Redux, Functional Reactive Programming, Angular, Node, MongoDB and frontend performance. He is currently employed as a as a UI Tech Lead, driving innovation forward, leading frontend teams towards success and generally striving to make the world a better place.","FirstName":"Vlad","LastName":"\"Reign\" Zelinschi","Code":84},{"Id":11,"Name":"Adrian Pironescu","Title":"Senior Software Engineer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/adrian.pironescu.jpg","CompanyName":"","CompanyUrl":"","Bio":"Adrian is Development Lead at Endava, Co-Founder and CTO at Marionette Studio - the first Online Animation Software for 2D Games. Adrian is a senior software engineer with a strong passion for web development and open technologies.","FirstName":"Adrian","LastName":"Pironescu","Code":84},{"Id":12,"Name":"Adrian Rîndașu","Title":"Managing Partner","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/adrian.rindasu.jpg","CompanyName":"","CompanyUrl":"","Bio":"Adrian co founded Edurom in 2002. Since then, he developed and delivered training and consultancy programs for various companies in the software development industry. He is running Belbin & Situational Leadership trainings for the IT&C clients of Edurom.","FirstName":"Adrian","LastName":"Rîndașu","Code":84},{"Id":13,"Name":"Adrian Trefas","Title":"Designer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/adrian.trefas.png","CompanyName":"","CompanyUrl":"","Bio":"Adrian is a designer with over 8 years experience in designing quality digital products. He is obsessed with sketching and UX practices. His work includes web and mobile applications, games and, occasionally, print or identity.","FirstName":"Adrian","LastName":"Trefas","Code":84},{"Id":14,"Name":"Adrian-Tudor Panescu","Title":"Software Development Engineer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/adrian-tudor.panescu.png","CompanyName":"","CompanyUrl":"","Bio":"Adrian-Tudor is a software development engineer with more than 5 years of experience building all sorts of software. He has a passion for Web applications, dynamic programming languages and vim. As a big fan of research and academia, he is currently working on the future of open data at figshare.","FirstName":"Adrian-Tudor","LastName":"Panescu","Code":84},{"Id":15,"Name":"Alecsandru Grigoriu","Title":"UX Lead","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/alecsandru.grigoriu.png","CompanyName":"","CompanyUrl":"","Bio":"Alecsandru Grigoriu is Lead UX Designer at Grapefruit (UX agency from Romania). He finished both his Bachelor and Master Thesis in Computer Science on fields such as Data Visualization and Game Design. Occasionally he collaborates with the Faculty and helds Human Computer Interaction lab classes designing smart projects with the students.","FirstName":"Alecsandru","LastName":"Grigoriu","Code":84},{"Id":16,"Name":"Alex Bordei","Title":"Web Developer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/alex.bordei.jpg","CompanyName":"","CompanyUrl":"","Bio":"My name is Alex Bordei and I am living in Bucharest.<br/>I'm 24 years old and in the last 6 year I was working in IT Development. Since 2012 I've started my own business in custom software development.<br/>I graduated Politehnica University of Bucharest in Physycs and Mathematics applied in engineering.<br/>I have over 4 years experience with many programming languages, like PHP, C#, Java, etc.","FirstName":"Alex","LastName":"Bordei","Code":84},{"Id":17,"Name":"Alex Pricop","Title":"Graphic & UI Designer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/alex.pricop.jpg","CompanyName":"","CompanyUrl":"","Bio":"Driven by childlike enthusiasm and a desire to further his knowledge Alex is a self-thought, multidisciplinary designer. His background consists of conceptualizing visual solutions for a range of deliverables including websites, mobile and web apps that effectively assist and inform the users. ","FirstName":"Alex","LastName":"Pricop","Code":84},{"Id":18,"Name":"Alexandru Darie","Title":"Creative Director","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/alexandru.darie.jpg","CompanyName":"","CompanyUrl":"","Bio":"I am a graphic designer, specialised in branding and digital applications. My approach towards each project, focuses on reducing the clutter around each problem; and then finding and presenting a simple and clear solution, that can communicate the client's needs and values. Currently creative director of Other Tribe.","FirstName":"Alexandru","LastName":"Darie","Code":84},{"Id":19,"Name":"Alexandru Rotaru","Title":"Managing Partner","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/alexandru.rotaru.jpg","CompanyName":"","CompanyUrl":"","Bio":"For the past 8 years I've been working with Altom Consulting, a Software Testing Consultancy company based in Romania.<br/>Being a small company, my role and tasks vary a lot. I work as a test engineer / test lead at customer's site on fixed length projects, I do administrative tasks, I do interviews and training sessions, I interact a lot with current and potential clients to try to understand their needs and problems. This makes it a great learning experience!<br/><br/>When I attended CAST in 2011 I loved the idea of an active testing community and the LAWST format. So, at the end of August that year, together with a friend, we decided to focus on reaching testers in four different towns in Romania by organising one-day Peer Conferences. This was a big effort, but I think it finally paid off: we were able to find passionate testers in each location that are willing to organise monthly meetings where people can talk about testing.<br/>The fact that I interact a lot with clients through my role at Altom and with actual testers through the testing community allows me to get a better view on how testing is seen both from the outside and form the inside. This also gives me the unique opportunity to reach both ends in order to change their mindset on software testing.","FirstName":"Alexandru","LastName":"Rotaru","Code":84},{"Id":20,"Name":"Alina Horbovanu","Title":"Senior Project Manager","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/alina.horbovanu.jpg","CompanyName":"","CompanyUrl":"","Bio":"Senior Project Manager with experience in Telecom, Banking and Insurance business domains, Prince 2 practitioner certified and with IT software development background.<br/>Co-Founder of Project Management Society community - started in Iasi in February 2015 and rapidly extended to Timisoara in November 2015 and Oradea in February 2016.<br/>Work experience in IT companies of different sizes, from startups to international companies, located mainly in: Iasi, Timisoara and Paris.<br/>Find more details at: https://www.linkedin.com/in/horbovanualina ","FirstName":"Alina","LastName":"Horbovanu","Code":84},{"Id":21,"Name":"Ancuta Damian","Title":"Project manager","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/ancuta.damian.jpg","CompanyName":"","CompanyUrl":"","Bio":"I'm an IT enthusiast interested in Agile methodologies. These days I'm curious about how Kanban techniques can make our lives easier when we're not at work :) ","FirstName":"Ancuta","LastName":"Damian","Code":84},{"Id":22,"Name":"Andreea Marinciu","Title":"Content Manager","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/andreea.marinciu.jpg","CompanyName":"","CompanyUrl":"","Bio":"Andreea is Content Manager at Grapefruit. She understood her relationship with letters early on, at kindergarden, where envy struck her in regard to a colleague that already knew how to write. With the passing of years this passion has been fueled by poetry contests, olympics attendances and literature circles. On her path to becoming a “grown up”, she stopped to graduate the Faculty of Journalism and Communication Sciences and a Masters in Techniques of editing production in written press, TV and multimedia at the “Alexandru Ioan Cuza” University of Iasi.","FirstName":"Andreea","LastName":"Marinciu","Code":84},{"Id":23,"Name":"Andrei Costin","Title":"Founder Firmware.RE, Independent Security Researcher","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/andrei.costin.jpg","CompanyName":"","CompanyUrl":"","Bio":"Andrei holds a PhD degree in \"Informatics and Networking\" from EURECOM/TelecomParisTech, where he successfully developed and defended his thesis on \"Large Scale Security Analysis of the Embedded Devices'Firmware\". He also holds a Computer Science engineering diploma from Politehnica University of Bucharest where he did his thesis work in Biometrics and Image Processing.<br/> <br/>While starting out his IT-career in the Computer Games industry, he has worked in the Telecom field and also was a senior developer at a specialized firm programming various GSM/UMTS/GPS sub-systems. He is the author of the MiFare Classic Universal toolKit (MFCUK), the first publicly available (FOSS) card-only key cracking tool for the MiFare Classic RFID card family and is known as the “printer guy” for his “Hacking MFPs” and “Hacking PostScript” series of hacks & talks at various international conferences. Lately, he was spotted security-harassing airplanes with ADS-B hacks (though no planes were harmed during the experiments) and remotely hacking fireworks/demolition/pyrotechnic systems (though no fireworks show were spoiled and no buildings were demolished). He is passionate about security in a holistic fashion. Currently Andrei is a PhD candidate with EURECOM in the field of “Software security in embedded systems”.<br/> <br/>At present, Andrei is mostly busy developing cutting edge security research for embedded systems as part of his Firmware.RE project.","FirstName":"Andrei","LastName":"Costin","Code":84},{"Id":24,"Name":"Andrei Verdes","Title":"Android Developer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/andrei.verdes.jpg","CompanyName":"","CompanyUrl":"","Bio":"Andrei is an Android developer that has been writing mobile applications for more than 4 years. Passionate about Android and new technologies, always striving to create the perfect Android app.","FirstName":"Andrei","LastName":"Verdes","Code":84},{"Id":25,"Name":"Anisoara Tirnovanu","Title":"Project Manager","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/anisoara.tirnovanu.jpg","CompanyName":"","CompanyUrl":"","Bio":"A project manager that developed as a communicator specialist during university and that developed an interest in learning how communication skills can help project managers in the IT world.","FirstName":"Anisoara","LastName":"Tirnovanu","Code":84},{"Id":26,"Name":"Bogdan Apostol","Title":"Senior Software Engineer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/bogdan.apostol.jpg","CompanyName":"","CompanyUrl":"","Bio":"Bogdan is a Senior Software Engineer and Founder at FreshCreative, PhD Student in Computer Vision and Image Processing, Co-Founder and CEO of Marionette Studio, the first Online Animation Software for 2D Game. The passion for technology has always been the driving factor for him. Bogdan is a researcher and a software engineer interested in creating innovation.","FirstName":"Bogdan","LastName":"Apostol","Code":84},{"Id":27,"Name":"Bogdan Livadariu","Title":"Senior QA Automation, Process lead","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/bogdan.livadariu.png","CompanyName":"NESS","CompanyUrl":"http://www.ness.com/","Bio":"For me automation is something that keeps me jacked into tech,<br/>the way web evolves new challenges arise and you have to tackle them if you want to grow your tech skills.<br/><br/>Not long ago I considered myself a JAVA automation enthusiast, now, things changed quite a bit, I do most of my automation work around JavaScript.<br/><br/>Although most of the rows above refer to web-automation, I also like building automation not only for web, but for whatever needs an automation or whatever else I find it interesting that might come in handy either for me or the community.","FirstName":"Bogdan","LastName":"Livadariu","Code":84},{"Id":28,"Name":"Bogdan Nastasa","Title":"Design Lead Endava Cluj","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/bogdan.nastasa.png","CompanyName":"","CompanyUrl":"","Bio":"Bogdan is highly creative with best ability to lead. He is a big picture thinker and a problem solver. He is a passionate UX/UI designer with programming capabilities.  <br/>Bogdan is passionate about what he does and loves to help people. Nothing is more fulfilling for him than being part of a team with similar interests, in an organization that values its employees.<br/>He represents a bridge between business decision makers, developers, designers and users.<br/>","FirstName":"Bogdan","LastName":"Nastasa","Code":84},{"Id":29,"Name":"Camelia Codarcea","Title":"Agile Coach, cofounder AgileHub","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/camelia.codarcea.jpg","CompanyName":"","CompanyUrl":"","Bio":"Camelia, one of the three cofounders of AgileHub, is passionate about leadership, public speaking and human interaction.  <br/>She started her agile journey in Germany, where she gained important knowledge and hands on experience about being a Scrum Master from the inside out. She is convinced that in the right environment people are eager for exelency. With her own words:„it feels like AgileHub is emerging the human side of the IT”<br/><br/>Her main activities are currently guiding and coaching companies and teams into their agile journey.  ","FirstName":"Camelia","LastName":"Codarcea","Code":84},{"Id":30,"Name":"Claudiu Draghia","Title":"Quality Manager","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/claudiu.draghia.jpg","CompanyName":"","CompanyUrl":"","Bio":"I have started to test back in 2004.  I had no idea at the beginning that I will love it so much. It was supposed to be a summer job that lasted for more than 10 years.<br/>I worked in different companies, in in house projects, as outsourced, within  proof of concept projects, with different technologies and different business areas.<br/>Since 2012 I got involved in local testing community and started to work on my own on testing related projects ( brainforit.com).","FirstName":"Claudiu","LastName":"Draghia","Code":84},{"Id":31,"Name":"Codecamper","Title":"","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/icon_user.png","CompanyName":"","CompanyUrl":"","Bio":"","FirstName":"","LastName":"","Code":84},{"Id":32,"Name":"Coffeemaker","Title":"","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/icon_coffee.png","CompanyName":"","CompanyUrl":"","Bio":"Relax, meet your friends and enjoy a cup of coffee, I'll be there too. ;)","FirstName":"","LastName":"","Code":84},{"Id":33,"Name":"Cosmin Alexandru SPÎNU","Title":"Software Developer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/cosmin.alexandru.spinu.jpg","CompanyName":"","CompanyUrl":"","Bio":"I work as a Software Developer since 2012, currently empoyee of TSS-Yonder. My main focus is on Java on backend, but I also developed on frontend using Java web frameworks.","FirstName":"Cosmin","LastName":"Alexandru SPÎNU","Code":84},{"Id":34,"Name":"Cosmin Dumitriu","Title":"Database Developer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/cosmin.dumitriu.png","CompanyName":"","CompanyUrl":"","Bio":"Cosmin has been working passionately within the database department of Optymyze for several years, contributing to all stages from design to production tuning. He is a great evangelist of the highly standardized SQL language and are continuously scrutinizing the horizon for new technologies that bring real-time data analysis at the fingertips of the average user.","FirstName":"Cosmin","LastName":"Dumitriu","Code":84},{"Id":35,"Name":"Cristi Bârlădeanu","Title":"Managing Partner","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/cristi.barladeanu.jpg","CompanyName":"","CompanyUrl":"","Bio":"Passionate of building things, Cristi leads a team of digital product artisans at NON. Not only preaching at Digital Product Group Iași, but also willing to make things happen on the local product scene, he co-founded ThinkOut, a cash flow planning platform expected to launch in May '16.","FirstName":"Cristi","LastName":"Bârlădeanu","Code":84},{"Id":36,"Name":"Cătălin Drăcşineanu","Title":"English Speakers Club Project Manager","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/catalin.dracsineanu.jpg","CompanyName":"","CompanyUrl":"","Bio":"PhD. Lecturer with over 18 years of academic teaching experience, skilful translator and trainer, author of the Manual of English for professionals (Polirom Publishing House, 2013), with a passion for the amazing power of words and out-of-the-box thinking. He will take you beyond the written words of speech delivering theories and help you improve not by telling you what to do, but by showing you how to do it.","FirstName":"Cătălin","LastName":"Drăcşineanu","Code":84},{"Id":37,"Name":"Dan Nicola","Title":"IT Consultant, trainer & coach","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/Dan.Nicola.jpg","CompanyName":"Strongbytes","CompanyUrl":"http://www.strongbytes.ro","Bio":"Dan is a Certified Scrum Master, a Scrum trainer and coach, always willing to help others make the transition to an Agile approach. He has been applying agile principles for several years and is very passionate about guiding teams in becoming self organized and committed to delivering customer value. Always eager to share his knowledge with others, learning from them at the same time.","FirstName":"Dan","LastName":"Nicola","Code":84},{"Id":38,"Name":"Dan Pogoreanu ","Title":"Software Engineer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/dan.pogoreanu.jpg","CompanyName":"","CompanyUrl":"","Bio":"Most of my career I've been involved in the development process of embedded media devices. Coming from automotive radios / media players to DVR's I had the opportunity to get familiar with the intricacies of the embedded systems and the applications running on them.","FirstName":"Dan","LastName":"Pogoreanu ","Code":84},{"Id":39,"Name":"Daniela Haliga","Title":"Business Analyst","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/daniela.haliga.jpg","CompanyName":"","CompanyUrl":"","Bio":"Working as a Business Analyst, gives me the chance to open up to a whole new world of challenges and opportunities. To bring out the best in people, to focus on clients true needs, to define, to offer and to deliver quality - this is the main-drive of a BA.<br/>","FirstName":"Daniela","LastName":"Haliga","Code":84},{"Id":40,"Name":"Diana Lefter","Title":"Senior QA Manager","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/diana.lefter.jpg","CompanyName":"","CompanyUrl":"","Bio":"https://ca.linkedin.com/in/dianalefter<br/><br/>I am an IT passionate, with 18 years experience in project management, development and QA management. My passion is QA management - I have been managing  the QA department for KPMG International for the last 8 years.  I have recently relocated back home to Romania, Iasi - my hometown, but still working with my virtual team all over the world. I want to share my experience with the Romanian IT communities and give back something to the city where I've accomplished my education. I am a product of the Romanian school and of international abroad experience ( 18 years in Canada and US).","FirstName":"Diana","LastName":"Lefter","Code":84},{"Id":41,"Name":"Dorel Grigore","Title":"Trainer & Consultant","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/dorel.grigore.jpg","CompanyName":"Ascendis Consulting","CompanyUrl":"http://www.ascendis.ro/","Bio":"Dorel Grigore has been an Ascendis consultant since 2006. His experience of over ten years in multinational corporations in the IT&C areas, and over eight years of entrepreneurship, add authenticity to the content of the seminars and workshops he delivers. In addition to the classical finance, marketing and management themes, Grig approaches a new dimension of modern learning techniques, having developed the e-learning and electronic commerce platforms for Ascendis in the past years.<br/><br/>After graduating from the Bucharest Academy of Economic Studies, he continued his postgraduate studies with specialized studies in marketing and management in Hungary, Switzerland, France, Great Britain, Spain, Belgium, Italy and the United States.  As a graduate of the International Association for Six Sigma Certification and Celemi accreditation, he has delivered courses and business simulations for over 60 companies in areas such as finance, production, retail, logistics, energy, IT&C, pharmaceuticals, distribution, and constructions.<br/><br/>As an entrepreneur and consultant, Grig values a lot people’s common sense, and the ingredients that should not be missing in any business: passion and humour.","FirstName":"Dorel","LastName":"Grigore","Code":84},{"Id":42,"Name":"Dragos Rusu","Title":"Team Lead","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/dragos.rusu.jpg","CompanyName":"","CompanyUrl":"","Bio":"Dragos is one of the Architects at BYTEX Iasi. He started as a backend guy and smoothly moved to UI during the past years, specializing in MVW frameworks, such as AngularJS. With more than 8 years hands-on experience and several technologies under his belt, Dragos is leading successful projects from inception to high performance and secured production environments. When he's not at work, he loves to travel and spend time with his family.","FirstName":"Dragos","LastName":"Rusu","Code":84},{"Id":43,"Name":"Emanuel Martonca","Title":"CEO and Co-founder","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/emanuel.martonca.jpg","CompanyName":"","CompanyUrl":"","Bio":"With a background in marketing, Manu has an extensive understanding of economic and market trends. He is motivated by the desire to work on products that make a difference. His main interest is creating the environment where team members can thrive, both professionally and personally, by developing the skills and expertise needed to create value for customers.","FirstName":"Emanuel","LastName":"Martonca","Code":84},{"Id":44,"Name":"Florin Cardasim","Title":"IT Consultant, trainer & coach","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/florin.cardasim2015.jpg","CompanyName":"CodeCamp Romania","CompanyUrl":"http://www.codecamp.ro","Bio":"Florin is a software architect and Agile coach. Beyond his technical skills, he gained a broad experience as a trainer for companies and speaker in community events. Florin is passionate by technology and by working with people to construct amazing things; focused on client and team, quality and on-time delivery while carefully looking to keep inside the fun of the software development.","FirstName":"Florin","LastName":"Cardasim","Code":84},{"Id":45,"Name":"Gabriel Enea","Title":"Microsoft MVP, Trainer, IT Consultant","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/gabriel.enea.jpg","CompanyName":"Strongbytes","CompanyUrl":"http://www.strongbytes.ro","Bio":"Gabriel is a software developer with over 15 years of experience in the IT industry and also one of the co-founders of the CodeCamp Romania community.<br/><br/>Since 2012, he has been awarded the Microsoft MVP on ASP.NET/IIS for his contribution to the community. <br/><br/>He is one of those developers for whom work is an art.<br/><br/>You can find him on Twitter at <a href=\"http://www.twitter.com/dotnet18\" target=\"_blank\">@dotnet18</a>.","FirstName":"Gabriel","LastName":"Enea","Code":84},{"Id":46,"Name":"Gabriel Manole","Title":"Software Development Manager","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/gabriel.manole.jpg","CompanyName":"","CompanyUrl":"","Bio":"Passionate in management and software development, Gabriel Manole brings together the experience of working with large teams and developing managers.<br/>He is co-founder of m.IT Iasi - the community of managers in IT, a place where passionate managers from local companies meet to learn and grow together. <br/>Gabriel is working with a strong team to create an international conference about leadership and IT management, right here in Iasi.","FirstName":"Gabriel","LastName":"Manole","Code":84},{"Id":47,"Name":"George Serediuc","Title":"Designer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/george.serediuc.jpg","CompanyName":"","CompanyUrl":"","Bio":"George is a multidisciplinary designer striving to create great experiences. He loves to build products that are purposeful and human-centered. His favorite things include unfiltered beer, science fiction novels, cosmology, and hiking. Currently designing positive outcomes at figshare.","FirstName":"George","LastName":"Serediuc","Code":84},{"Id":48,"Name":"Georgiana Gligor","Title":"Large-scale application architect","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/georgiana.gligor.jpg","CompanyName":"","CompanyUrl":"","Bio":"Having crafted professional software since 2003, Georgiana is living proof that geek girls are an asset to any team. She loves coding large-scale applications and mentoring team mates in achieving craftsmanship. Georgiana has experience in every aspect of the life cycle of software development and is hungry for more.","FirstName":"Georgiana","LastName":"Gligor","Code":84},{"Id":49,"Name":"Iavi Rotberg","Title":"Senior Business Analyst","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/iavi.rotberg.jpg","CompanyName":"","CompanyUrl":"","Bio":"Energetic, resourceful and performance-driven Business Analyst and Product Manager with an entrepreneurial spirit having proven experience in the market. A perceptive and innovative individual, I am unafraid to exploit my resourceful thinking and persistence and go outside the conventional box. ","FirstName":"Iavi","LastName":"Rotberg","Code":84},{"Id":50,"Name":"Ionut Albert Maxim","Title":"UX Architect","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/ionut.albert.maxim.jpg","CompanyName":"","CompanyUrl":"","Bio":"Curious about the WHY behind people's actions and reactions. <br/><br/>Doing my best to silence the judging synapse, become the voice of my client’s Client and make sure he or she gets the proper attention from your product or service. <br/><br/>Star Trek, Earl Grey and smooth music raise my eyebrow and lonely neuron. ","FirstName":"Ionut","LastName":"Albert Maxim","Code":84},{"Id":51,"Name":"Ionut Andonescu","Title":"Scala Developer, Process Lead","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/ionut.andronescu.jpg","CompanyName":"","CompanyUrl":"","Bio":"Software Development Engineer with experience in multiple projects involving Java Stack. His areas of interest include functional programming and Big Data technologies.","FirstName":"Ionut","LastName":"Andonescu","Code":84},{"Id":52,"Name":"Ionut Grecu","Title":"Scrum Master","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/ionut.grecu.png","CompanyName":"HEG","CompanyUrl":"","Bio":"Ionut Grecu has been involved in IT for the last 7+ years. His work exists at the intersection of Agile Transformation, Lean Thinking, Psychology, and Anthropology. Weird, right? <br/><br/>He is a believer in servant leadership and the power that Agile and Lean thinking and techniques can bring to an organization. Being a bookish sort who always loves a mental challenge, he would be bored if he wasn’t constantly learning. Yet he has the ability to focus and research deeply in a narrow field of specialization. <br/><br/>Life's big questions interest him most. When he is out of the office you can find him eating shawarma, sitting at a table near you. He has a self-proclaimed PhD in napping in any position you can think of.","FirstName":"Ionut","LastName":"Grecu","Code":84},{"Id":53,"Name":"Isabela Buhai","Title":"DU Manager Endava Cluj","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/isabela.buhai.png","CompanyName":"","CompanyUrl":"","Bio":"Isabela is passionate about people and innovation and has a strong desire to enact social change. She has worked within the financial, insurance, healthcare, telecommunication services and media industry for over 10 years in various multicultural and international setups across Europe and the United States.<br/>During this time she specialised in assisting companies with large programmes of technology renewal and has been engaged throughout her career in the implementation and coordination of large nearshore delivery teams distributed across multiple locations, project and programme management and IT consultancy.<br/>Isabela is now the Delivery Unit Manager of Endava Cluj, being responsbile for the  nearshore development centre. In her role, Isabela is actively looking at identifying and growing talented people that can make a difference in the challenging and dynamic IT sector, along with overseeing the engagement models and projects delivery from this location.<br/>","FirstName":"Isabela","LastName":"Buhai","Code":84},{"Id":54,"Name":"Iuliana Burdun","Title":"Business Analyst","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/iuliana.burdun.jpg","CompanyName":"","CompanyUrl":"","Bio":"Iuliana is a Business Analyst who has worked on a wide range of projects within both the public and private sectors. She is now part of the Thinslices team helping clients turn their business idea into a live product.","FirstName":"Iuliana","LastName":"Burdun","Code":84},{"Id":55,"Name":"Larisa Alexa","Title":"Software Develoepr","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/larisa.alexa.jpg","CompanyName":"Endava","CompanyUrl":"http://www.endava.com/","Bio":"Larisa is a software developer working at Endava Iasi on back-end development using Java, Maven, Spring and other technologies. Larisa is a fast learner whenever she discovers an exciting topic; and right now she is really passionate about the code quality world.","FirstName":"Larisa","LastName":"Alexa","Code":84},{"Id":56,"Name":"Liviu Costea","Title":"Software Developer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/liviu.costea.jpg","CompanyName":"","CompanyUrl":"","Bio":"I am currently leading the development efforts of Biz Pro Technologies where we are building the next generation Travel Platform and a place where we always try to use the best tool for the job. I am enthusiast about combining SQL and NewSQL solutions: at BizPro we have been using Memcache for a while now, then in the last 2 years we added Redis and now we are considering Aerospike for our stack.","FirstName":"Liviu","LastName":"Costea","Code":84},{"Id":57,"Name":"Liviu Mazilu","Title":"Team Lead","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/liviu.mazilu.png","CompanyName":"Expert Network","CompanyUrl":"http://www.expertnetwork.eu/home","Bio":"Enthusiast software engineer working in Expert Network since 2010.","FirstName":"Liviu","LastName":"Mazilu","Code":84},{"Id":58,"Name":"Luciana Andronic","Title":"Business Analyst","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/luciana.andronic.jpg","CompanyName":"","CompanyUrl":"","Bio":"Business Analyst with experience on projects in different business areas, Certified Scrum Master and with IT software development background. ","FirstName":"Luciana","LastName":"Andronic","Code":84},{"Id":59,"Name":"Mihai Bura","Title":"Software Development Engineer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/mihai.bura.jpg","CompanyName":"","CompanyUrl":"","Bio":"I am an eager learner who’s in love with front end technologies and always challenging himself to discover new ways of building the web.","FirstName":"Mihai","LastName":"Bura","Code":84},{"Id":60,"Name":"Mihai Zugravu","Title":"Agile & TV Series Geek","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/mihai.zugravu.jpg","CompanyName":"","CompanyUrl":"","Bio":"Mihai is just the average Agile guy doing average Agile type of things. He sometimes successfully tries to help others get better at their jobs, so they wont bother him anymore in the future. He's most happy when teams don't really need an Agile guy anymore - but he's still waiting on that day to come. He started learning about Project Management stuff a while back, continued with Agile frameworks and realized the internet's too big to finish reading and learning.  ","FirstName":"Mihai","LastName":"Zugravu","Code":84},{"Id":61,"Name":"MÂRZA Anghel-Adrian","Title":"freelancer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/marza.anghel.adrian.png","CompanyName":"Mozilla","CompanyUrl":"","Bio":"Technician by day, FOSS enthusiast by night.","FirstName":"MÂRZA","LastName":"Anghel-Adrian","Code":84},{"Id":62,"Name":"Oana Blaga","Title":"UI/UX Designer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/oana.blaga.png","CompanyName":"","CompanyUrl":"","Bio":"I am a UI/UX designer, blogger and music lover. I am truly passionate about UX, always focused on creating the best user experience possible for the end user, always focused on making them happy. Living the UX dream since 2013.<br/>Follow my story on blagaoana.com","FirstName":"Oana","LastName":"Blaga","Code":84},{"Id":63,"Name":"Oana Scutarasu","Title":"Business Analyst","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/oana.scutarasu.png","CompanyName":"","CompanyUrl":"","Bio":"In the ongoing superhero soap opera of Software Development, I am an outspoken BA redhead that recasts into Developer Language the Client’s needs. Working closely with another superhero of the series, the Designer, we concoct the Client’s vision into amazing screens which will be used by the Development Team in creating the product. My superhero weapons are anticipation, negotiation, elicitation and analysis techniques.","FirstName":"Oana","LastName":"Scutarasu","Code":84},{"Id":64,"Name":"Ovidiu Avasilcai","Title":"Frontend Developer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/ovidiu.avasilcai.jpg","CompanyName":"","CompanyUrl":"","Bio":"Frontend Developer with a background in IT services. Over the years I've had the pleasure of working in many areas of IT service industry, from customer/tech support, devops, dba, project coordination and development.<br/>I have an interest in frontend development and the open source communities that have evolved around it.","FirstName":"Ovidiu","LastName":"Avasilcai","Code":84},{"Id":65,"Name":"Petronela Zaharia","Title":"Business Development Executive","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/petronela.zaharia.jpg","CompanyName":"","CompanyUrl":"","Bio":"International sales specialist with more than 13 years of experience and a Ph. D. degree in International Trade. For the last years she worked as Export Manager in a pharmaceutical company.  Recently she changed the industry and started working as sales specialist in the IT industry. <br/>She is passionate about communication and specialized in sales and negotiation across cultures.","FirstName":"Petronela","LastName":"Zaharia","Code":84},{"Id":66,"Name":"Radu Iscu","Title":"Solution Architect","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/radu.iscu.jpg","CompanyName":"","CompanyUrl":"","Bio":"Radu has been a software professional for a while now. He's worked on both small and large projects, small and large companies, and in this time he's learned a lot of stuff about code. He's passionate about extreme programming, flexible design, emergent architecture and refactoring, to the point where he won't stop talking about it.","FirstName":"Radu","LastName":"Iscu","Code":84},{"Id":67,"Name":"Radu Pintilie","Title":"Technical Lead","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/radu.pintilie.png","CompanyName":"Expert Network","CompanyUrl":"http://www.expertnetwork.eu/home","Bio":"Working with Expert Network since 2008, mainly interested in Cloud computing and software architecture.","FirstName":"Radu","LastName":"Pintilie","Code":84},{"Id":68,"Name":"Raluca Apostol","Title":"Senior Developer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/raluca.apostol.jpg","CompanyName":"","CompanyUrl":"","Bio":"Raluca is Senior Developer and Scrum Master at Endava Iasi, PhD Researcher in Machine Learning Algorithms and Co-Founder and Chief Product Officer of Marionette Studio, the first Online Animation Software for 2D Games. She loves innovation and non-conventional problem solving. She thinks that everything is possible, you just need to set a goal, set some milestones and start working right away.","FirstName":"Raluca","LastName":"Apostol","Code":84},{"Id":69,"Name":"Razvan Gavrilas","Title":"Founder","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/razvan.gavrilas.png","CompanyName":"","CompanyUrl":"","Bio":"Razvan Gavrilas is the Founder & Chief Architect of cognitiveSEO & BrandMentions, tools to help you monitor, research and improve your digital marketing.","FirstName":"Razvan","LastName":"Gavrilas","Code":84},{"Id":70,"Name":"Robert Kristo","Title":"Database Developer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/icon_user.png","CompanyName":"","CompanyUrl":"","Bio":"Robert has been working passionately within the database department of Optymyze for several years, contributing to all stages from design to production tuning. He is a great evangelist of the highly standardized SQL language and are continuously scrutinizing the horizon for new technologies that bring real-time data analysis at the fingertips of the average user.","FirstName":"Robert","LastName":"Kristo","Code":84},{"Id":71,"Name":"Romulus Crisan","Title":"Developer Evangelist","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/romulus.crisan.jpg","CompanyName":"","CompanyUrl":"","Bio":"Romulus is a passionate and trustworthy software developer that guides other developers to be successful in working with frameworks and API’s. He’s a problem solver with expertise that spans on a significant number of different subject areas, like translation, finance or digital media. His constant curiosity keeps him in a good shape regarding new technologies and gadgets of which he loves to read, learn and of course experiment.","FirstName":"Romulus","LastName":"Crisan","Code":84},{"Id":72,"Name":"Serediuc Florin","Title":"Technical Team Lead","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/serediuc.florin.jpg","CompanyName":"UBIS","CompanyUrl":"","Bio":"I have been involved in many projects as developer, but also currently as technical team lead and I'm always passionate about new technologies and new ways to develop software. ","FirstName":"Serediuc","LastName":"Florin","Code":84},{"Id":73,"Name":"Sorin Damian","Title":"Software Engineer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/sorin.damian.jpg","CompanyName":"","CompanyUrl":"","Bio":"Passionate developer, always looking for a challenge.","FirstName":"Sorin","LastName":"Damian","Code":84},{"Id":74,"Name":"Sveatoslav Circel","Title":"IT Consultant/Scrum Master","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/sveatoslav.circel.jpg","CompanyName":"","CompanyUrl":"","Bio":"Having 6+ years’ experience in IT world, I'm responsible, flexible and self-motivated individual with excellent interpersonal, analytical and communication skills. A thorough professional armed with excellent testing and coding skills by virtue of five plus years of experience with flavors of both Automation and Manual Test Engineering; successfully developed automation frameworks, on both open source and commercial variants. Feel free to follow me on twitter @sveat0slav","FirstName":"Sveatoslav","LastName":"Circel","Code":84},{"Id":75,"Name":"Todd and Marius","Title":"","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/icon_user.png","CompanyName":"TiVO","CompanyUrl":"http://www.tivo.com","Bio":"Todd and Marius have not met until November last year at Codecamp. They hardly ever spoke to each other ever since, except one time over a few glasses of Napa wine. Inherently their talk was about ... SW (you thought wine?). They are passionate engineers, with 35 years of experience between them in developing small and large SW driven electronics. As managers, they question everything, and they ask “Why” more than a 4-year old. So it was not long until they landed on a common question: Why are so few SW development organizations really successful? Since they have not found the answer, they decided to explain “why not” in a larger audience.","FirstName":"Todd","LastName":"and Marius","Code":84},{"Id":76,"Name":"Tudor Teodoru","Title":"Solution Architect","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/tudor.teodoru.png","CompanyName":"Levi 9","CompanyUrl":"","Bio":"Tudor is working at Levi 9 since 2012. He is passionate about programming and software architecture.","FirstName":"Tudor","LastName":"Teodoru","Code":84},{"Id":77,"Name":"Valentin IONITA","Title":"Software Engineer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/valentin.ionita.jpg","CompanyName":"Cegeka","CompanyUrl":"http://www.cegeka.com/ro","Bio":"Valentin is a software engineer, modeling junkie hooked up on Domain Driven Design, occasional trainer and speaker. He is also a strong believer in quality code and people empowerment.","FirstName":"Valentin","LastName":"IONITA","Code":84},{"Id":78,"Name":"Vasile Putină","Title":"Agile Coach & trainer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/vasile.putina.jpg","CompanyName":"","CompanyUrl":"","Bio":"Agile Coach. Agile transition program coordinator at Pentalog.<br/>His passion for agility and coaching has helped many teams and clients to maximize the value delivered to end users. Being 15 years in IT, it managed to achieve a multilateral vision of this field through experience as lecturer, programmer in different languages, Scrum Master, manager, agile trainer and coach. In his opinion, agility is about people and their ability to overcome the limits being guided by a set of values.","FirstName":"Vasile","LastName":"Putină","Code":84},{"Id":79,"Name":"Vlad Bicu","Title":"Frontend Developer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/vlad.bicu.jpg","CompanyName":"","CompanyUrl":"","Bio":"Vlad is a frontend developer since 2012, likes Flexbox and the Google Chrome DevTools, and is passionate about Rubik's cube. He enjoys turning complex problems into simple, beautiful and intuitive interface designs by means of HTML, CSS and JavaScript.","FirstName":"Vlad","LastName":"Bicu","Code":84},{"Id":80,"Name":"Vlad Durnea","Title":"Software Engineer","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/vlad.durnea.png","CompanyName":"","CompanyUrl":"","Bio":"Vlad is one of the community organizers of IasiJS - the local JavaScript user group. <br/>He also works as a Senior Software Engineer specialized on frontend-heavy web applications.","FirstName":"Vlad","LastName":"Durnea","Code":84},{"Id":81,"Name":"Vlad Iliescu","Title":"Director","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/vlad.iliescu.jpg","CompanyName":"Maxcode","CompanyUrl":"http://www.maxcode.net","Bio":"Vlad is one of those people lucky enough to get paid for doing what they love - developing software. He also enjoys giving talks on various subjects, overcooking food and referring to himself in the third person. You can find out more about him on vladiliescu.ro.","FirstName":"Vlad","LastName":"Iliescu","Code":84},{"Id":82,"Name":"Vlad Maniac","Title":"Technology Manager","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/vlad.maniac.jpg","CompanyName":"","CompanyUrl":"","Bio":"Web passionate. Enough said :)","FirstName":"Vlad","LastName":"Maniac","Code":84},{"Id":83,"Name":"Vlad Ungureanu","Title":"Senior Java Developer, Founder LearnStuff.ro","PortraitImageUrl":"http://iasi.codecamp.ro/images/speakers/vlad.ungureanu.jpg","CompanyName":"","CompanyUrl":"","Bio":"My experience as a Senior Java Developer consists of a wide range of technologies starting with back-end development using EJB or Spring, front-end development with JSF, IceFaces, PrimeFaces,Spring MVC or AngularJS and database development with PostgreSQL, Oracle or Sybase. I worked on over 25 projects out of which the longest took 4 years to develop and the shortest took a little over 6 weeks.","FirstName":"Vlad","LastName":"Ungureanu","Code":84}],"Sessions":[{"Id":1,"Start":"2016-05-23T08:00:00+0000","End":"2016-05-23T08:45:00+0000","Title":"JRebel - revolutionize your development","mock":"","OverrideTracks":false,"SpeakerRefIds":[72],"TrackRefId":1,"Description":"The aim of this presentation is to open a new perspective in developing software which will increase your productivity in time and decrease your costs with at least 30%. In a nutshell, JRebel is a Java development-time tool that will instantly reload all your code changes without having to publish, restart or redeploy your application. If I got your attention and you want more...I'll see you at my presentation! :)"},{"Id":2,"Start":"2016-05-23T09:00:00+0000","End":"2016-05-23T09:45:00+0000","Title":"Use your data to understand the world: extracting meaning out of free form text and beyond.","mock":"","OverrideTracks":false,"SpeakerRefIds":[4],"TrackRefId":1,"Description":"Word embeddings are one of the most exciting topics in machine learning today, and thanks to recent developments it's never been easier to harness their power. Starting from a simple problem, we'll have a look at how and why they work, see them in action using TensorFlow, then peek at how these concepts can be help you with your own challenges."},{"Id":3,"Start":"2016-05-23T10:00:00+0000","End":"2016-05-23T10:45:00+0000","Title":"Enterprise Code Monkeys: Process and Tools","mock":"","OverrideTracks":false,"SpeakerRefIds":[77],"TrackRefId":1,"Description":"Lot of software development endeavors are broken and constantly fail to deliver expected results. Let's take a close look at some of the problems, how did we get here and what can we, as developers, do about it. Are we just \"code monkeys\" or a partner for business that happens to solve problems with software?"},{"Id":4,"Start":"2016-05-23T12:00:00+0000","End":"2016-05-23T12:45:00+0000","Title":"Soft Skills — Balancing feelings and business","mock":"","OverrideTracks":false,"SpeakerRefIds":[6],"TrackRefId":1,"Description":"Every day at work we deal with people. They are at the core of every business—beyond processes, documentation, code or other artifacts. In successful career, your technical growth will begin to plateau unless you look after your leadership growth. So what does it mean to be a leader? Can everyone be a leader, or do you have to become a team lead or manager?"},{"Id":5,"Start":"2016-05-23T13:00:00+0000","End":"2016-05-23T13:45:00+0000","Title":"Moving forward with ASP.NET Core 1.0","mock":"","OverrideTracks":false,"SpeakerRefIds":[45],"TrackRefId":1,"Description":"For the first time in 15 years, Microsoft introduces a new way for building modern cloud-based Web applications using ASP.NET. Branded as ASP.NET Core 1.0, the new platform, redesigned from the ground, provides an optimized development framework for apps that span from on-premises to cloud based solutions. In this session, we will highlight the changes and walk through the new concepts."},{"Id":6,"Start":"2016-05-23T14:00:00+0000","End":"2016-05-23T14:45:00+0000","Title":"Async end to end testing of angular.js apps","mock":"","OverrideTracks":false,"SpeakerRefIds":[82],"TrackRefId":1,"Description":"About the challenges coming when migrating from a selenium end to end testing solution to testing an angular front-end"},{"Id":7,"Start":"2016-05-23T08:00:00+0000","End":"2016-05-23T08:45:00+0000","Title":"The Future of Work","mock":"","OverrideTracks":false,"SpeakerRefIds":[1],"TrackRefId":2,"Description":"This Session will cover the latest thinking and indicators of answers around that changes are already happening - for example: greatly increased longevity rise of smart machines, systems and automation computational world super-structured organisations globally connected world new media ecology gig economy, re-distribution of workforces"},{"Id":8,"Start":"2016-05-23T09:00:00+0000","End":"2016-05-23T09:45:00+0000","Title":"Beyond Technical Expertise – a story about why occasionally the better team succeeds","mock":"","OverrideTracks":false,"SpeakerRefIds":[9],"TrackRefId":2,"Description":"Brilliant software engineering skills, combining development, testing, analysis, architecture and project management capabilities, are the prerequisites for a successful software project. Being part of and working with development teams for the past 25 years I have learned – sometimes the hard way – that there is more to it, when you want to end up with a successful project and a satisfied customer. I confess, sometimes it is out of our control or sometimes it is sheer luck. Over time, though, I have observed patterns of behaviour and skills beyond technical expertise that increased the probability of project success. I offer a few episodes of a customer story in which team members did exactly that: increased this probability and made a difference. So, please join me on a brief journey to explore and reflect on topics such as domain interest, diversity, business acumen or cultural sensitivity. I do not want to “distract” you from your expertise in software engineering. Master it! However, if you reflect these stories, the next time it may be you, who consciously increases the probability of success. "},{"Id":9,"Start":"2016-05-23T10:00:00+0000","End":"2016-05-23T10:45:00+0000","Title":"A Lap Around Microsoft Azure Mobile Apps","mock":"","OverrideTracks":false,"SpeakerRefIds":[5],"TrackRefId":2,"Description":"Your awesome mobile app needs a backend to match. Come to this session to find out how you can add backend logic and scale it out in a matter of seconds. Sending millions of push notifications to iOS, Android and Windows Phone apps; automatically syncing data between the device and the backend with Offline Data Sync; social integration with Facebook, Twitter and Google; and more. Code in C# or Node.js; and get uptime SLA with no servers to manage."},{"Id":10,"Start":"2016-05-23T12:00:00+0000","End":"2016-05-23T12:45:00+0000","Title":"What did Peter Drucker eat for breakfast: Culture or Strategy?","mock":"","OverrideTracks":false,"SpeakerRefIds":[75],"TrackRefId":2,"Description":"Ideas, as well as software development organizations, are modeled by the people who use them.  Whether the origin of an idea is shrouded in folklore or of well accepted providence, whether an idea is known today as first presented by its author or it has evolved to fit the needs of the people, it is indisputable that people select, filter and transform the world around them to meet their needs.  A software development organization may be created and built on state of the art management principles, but it won’t be successful unless all of its members (engineers and managers alike) shape it to naturally serve its purpose and make them and itself successful.  But if it’s that simple, why is it so rare?"},{"Id":11,"Start":"2016-05-23T13:00:00+0000","End":"2016-05-23T13:45:00+0000","Title":"Quality Assessment in the Tower of Babel","mock":"","OverrideTracks":false,"SpeakerRefIds":[8,55],"TrackRefId":2,"Description":"Source control systems like Git, TFS, or SVN store silently meta-data about our development activity. Currently, this wealth of historical information about projects is mostly ignored. During this session we will prove that these meta-data can reveal a lot about the quality of your code base but also your development process. We introduce a highly innovative yet intriguingly simple approach by which source control meta-data is used to assess the quality of a software system without actually analysing the code itself. In fact, the biggest benefit of this approach is that it breaks the constraints of language-dependent analysis techniques and tools: all source files are analysed together independent of their programming language, and quality issues are reported even for files that are ignored by traditional code quality tools (e.g. configuration files, SQL files) In this session we will demonstrate how a multitude of anti-patterns can be detected strictly based on the source-control meta-data. We will show detection techniques referring to unusual patterns of change, like files with a sudden growth or a high frequency of changes, files with insufficient amount of refactoring, etc. We will also discuss how team anomalies can be detected (e.g. unstable teams, too many developers working at the same time on the same file, or files with a high risk of knowledge loss due to developers having left the project). Furthermore, we will see how source-control meta-data can be used to get quickly a rough understanding of an unknown code base; this includes an overview of the technologies being used, the dynamics of the project’s team, the developers that have the best understanding of the system, and the quality hotspots of a project. We will also show how information visualisation techniques can help us to explore efficiently this wealth of data, for example the distribution of anti-patterns or technologies across the system."},{"Id":12,"Start":"2016-05-23T14:00:00+0000","End":"2016-05-23T14:45:00+0000","Title":"Community Open Panel","mock":"","OverrideTracks":false,"SpeakerRefIds":[44],"TrackRefId":2,"Description":"TBD..."},{"Id":13,"Start":"2016-05-23T08:00:00+0000","End":"2016-05-23T08:45:00+0000","Title":"Continuous Integration For Databases","mock":"","OverrideTracks":false,"SpeakerRefIds":[76],"TrackRefId":3,"Description":"Continuous integration removes uncertainty from development process. By including databases in CI process, problems are found early, development process is smoother and integration problems are reduced. This presentation covers database as code, database versioning and testing, creating database artifact and something that every developer should want: a personal database."},{"Id":14,"Start":"2016-05-23T09:00:00+0000","End":"2016-05-23T09:45:00+0000","Title":"Caching: Cloud edition","mock":"","OverrideTracks":false,"SpeakerRefIds":[67,57],"TrackRefId":3,"Description":"In this session we'll focus on caching solutions available to us inside Azure, taking a deeper dive into Redis Cache. In the context of high performance web applications we'll touch subjects like patterns, data management, data expiration, concurrency and high availability."},{"Id":15,"Start":"2016-05-23T10:00:00+0000","End":"2016-05-23T10:45:00+0000","Title":"In-memory databases - bridge the gap between OLAP and OLTP","mock":"","OverrideTracks":false,"SpeakerRefIds":[34,70],"TrackRefId":3,"Description":"The recent developments of 64-bit computing, multi-core servers and the plunging cost of memory chips have enabled enterprises to cache entire data warehouses into memory. They achieve blazing fast responses to analytical queries but can still run transactional processing within the same system without the need to duplicate the data in pre-aggregated OLAP cubes. We’ll be talking about the challenges that must be addressed, the advantages and disadvantages of such systems."},{"Id":16,"Start":"2016-05-23T12:00:00+0000","End":"2016-05-23T12:45:00+0000","Title":"Automated Deployments for Hipsters","mock":"","OverrideTracks":false,"SpeakerRefIds":[73,81],"TrackRefId":3,"Description":"Not sure what to look for in a CI server? Already using one and you're curious about TeamCity? And what about deployments? Do you manually copy everything to its rightful place, or are you using a more sophisticated approach? Have you tried Octopus Deploy? Join us and let's explore the little things that make those tools awesome. Be advised - this talk has been known to cause feature envy for users of other tools."},{"Id":17,"Start":"2016-05-23T13:00:00+0000","End":"2016-05-23T13:45:00+0000","Title":"Conquering The Common Fears That Burden Agile Teams","mock":"","OverrideTracks":false,"SpeakerRefIds":[52],"TrackRefId":3,"Description":"Going Agile means embracing changes at every level. And the change is scary to most people. They are taken out of their comfort zones, way out of the safety of what they know, and are placed into strange and unfamiliar new territories where their status and expertise are potentially under threat. They become reluctant once they realize the shift requires behavioral changes to their familiar responsibilities and roles. They are afraid of being vulnerable, afraid of losing control, afraid of the unknown, afraid of failure, afraid of no longer being needed. Join me to attack the common fears head-on, as I will share some possible solutions to help you deal with the scariest aspects of going Agile. Even if you have yet to take the leap into Agile and are testing the waters, or you have done it all and are continuing to learn, this session will be beneficial for you. "},{"Id":18,"Start":"2016-05-23T14:00:00+0000","End":"2016-05-23T14:45:00+0000","Title":"Why I don't do TDD","mock":"","OverrideTracks":false,"SpeakerRefIds":[83],"TrackRefId":3,"Description":"TDD is one of the hottest topics out there, alongside Agile methodology and practices. Defined by three simple steps and with the promise of such a great time you will never want to drop it still a mystery why it hasn’t become a standard in the 50 years it has existed. I propose a discussion on some of the reasons why TDD is not the testing panacea many have claimed it to be and why people have such a hard time putting such an elegant solution to practice."},{"Id":19,"Start":"2016-05-23T08:00:00+0000","End":"2016-05-23T08:45:00+0000","Title":"From Idea to Product in 48 Hours","mock":"","OverrideTracks":false,"SpeakerRefIds":[14,13,79],"TrackRefId":4,"Description":"What holds you from building that world-changing idea you always dreamed about? Time, money, knowledge? We were just like you before entering a 48-hour hackathon with 1200 teams from around the world competing to build the next big thing. And now, we will show you that with the right tools, workflows and mindset you can also build a fully-working app in less than those 48 hours (which is more than a working week by the way)."},{"Id":20,"Start":"2016-05-23T09:00:00+0000","End":"2016-05-23T09:45:00+0000","Title":"Android Annotations Framework - Love it or hate it","mock":"","OverrideTracks":false,"SpeakerRefIds":[24],"TrackRefId":4,"Description":"An introduction into the AndroidAnnotations Framework and how it helps us, the Android Team at Maxcode, to handle boilerplate code and to focus on what really matters. We'll also be discussing about the issues we had these last couple of years with AndroidAnnotations and how we managed to tackle them. "},{"Id":21,"Start":"2016-05-23T10:00:00+0000","End":"2016-05-23T10:45:00+0000","Title":"Building my first mobile app with UWP","mock":"","OverrideTracks":false,"SpeakerRefIds":[71],"TrackRefId":4,"Description":"Nowadays all sorts of devices are popping up into our lives and being a developer I’m intrigued by the idea of customizing or building apps for this type of devices. As you all know perfectly our time is limited and since I make my living out of Microsoft technology until recently the only real option to tinker with this devices was to learn a new technology. Personally I loved the idea of learning something completely new but my boss and my family decide against it. Last year Microsoft launched the new Universal Windows Platform and I thought that this is my “breakout” ticket since I already know most of the technology, or at least I thought I knew it … . So in this session I want to share my experience on building my first mobile application using Microsoft Universal Windows Platform. To be more specific I will talk about tools, data binding and layouts."},{"Id":22,"Start":"2016-05-23T12:00:00+0000","End":"2016-05-23T12:45:00+0000","Title":"A Good IT Professional Masters Technology. A Great One Also Masters Communi-cation","mock":"","OverrideTracks":false,"SpeakerRefIds":[36],"TrackRefId":4,"Description":"Good listening skills, empathy, diplomacy – these are hardly the first words anyone would use to describe an IT professional. However, good communication skills are for a professional what marketing is for a business. It’s something that needs to be done professionally, otherwise the end result may simply turn against you instead of helping you. This workshop aims at helping IT professionals with their English communication skills and improve their ability to build powerful relationships. "},{"Id":23,"Start":"2016-05-23T13:00:00+0000","End":"2016-05-23T13:45:00+0000","Title":"cheap china, kitch and badly written code","mock":"","OverrideTracks":false,"SpeakerRefIds":[66],"TrackRefId":4,"Description":"Most of us have had the misfortune of working on a codebase that was brittle, had bad coding practices and seems to have been churned out just to make a quick buck. Some of the greatest minds in computer programming have worked hard to make sure that this doesn't happen, giving us principles, patterns and practices that are meant to fix these issues. Despite this, amazing amounts of bad code still make it into production every day. Similar problems were encountered in art over the years, particularly in the former communist block, and we have some important lessons to learn from that."},{"Id":24,"Start":"2016-05-23T14:00:00+0000","End":"2016-05-23T14:45:00+0000","Title":"I quit!","mock":"","OverrideTracks":false,"SpeakerRefIds":[80],"TrackRefId":4,"Description":"Winners don't quit... or do they?"},{"Id":25,"Start":"2016-05-23T08:00:00+0000","End":"2016-05-23T08:45:00+0000","Title":"Research first, design after.","mock":"","OverrideTracks":false,"SpeakerRefIds":[62],"TrackRefId":5,"Description":"Research is probably the most under-rated stages in a design process. It becomes too easy to skip it when Stakeholders ”don’t see the need to spend their budget on it”; Product Managers stress up to finish “urgent” tasks; or (young) designers just don't see the real potential of it. Sometimes our audience is so variant, we tell ourselves there is no specific exploration that can be applied or we just think our decisions are correct upfront based just on our experience or assumptions. And they are great! They are absolutely necessary for designers to work, but they become dangerous when treated as facts. Design research gives us a structured, methodical approach to a understanding the users; in ways that no other approach can."},{"Id":26,"Start":"2016-05-23T09:00:00+0000","End":"2016-05-23T09:45:00+0000","Title":"UXD Myth Busting Cafe","mock":"","OverrideTracks":false,"SpeakerRefIds":[50],"TrackRefId":5,"Description":"User eXperience Design may seem like a pretty fresh animal in the software development ecosystem. Clients see a cheetah, developers see a hyena, and designers spot a giraffe. Let's look closer into the matter and see if the beast needs taming. "},{"Id":27,"Start":"2016-05-23T10:00:00+0000","End":"2016-05-23T10:45:00+0000","Title":"Applying atomic web design principles to information architecture","mock":"","OverrideTracks":false,"SpeakerRefIds":[22,15],"TrackRefId":5,"Description":"The presentation will focus on applying atomic design principles when building an Information Architecture for a large scale project. We will highlight with true examples how we structured our molecules, atoms and templates etc."},{"Id":28,"Start":"2016-05-23T12:00:00+0000","End":"2016-05-23T12:45:00+0000","Title":"Designers and Coders are brothers, not contes-tants","mock":"","OverrideTracks":false,"SpeakerRefIds":[18],"TrackRefId":5,"Description":"We need to debunk the myth that designers and coders perform different functions in any given project. Since the role of the team has become more dynamic, it's up to us to make use of these new perspectives and solve problems on a new level. Let's discuss how we can improve this interaction, to achieve better results!"},{"Id":29,"Start":"2016-05-23T13:00:00+0000","End":"2016-05-23T13:45:00+0000","Title":"Marionette Studio: From Idea to MVP","mock":"","OverrideTracks":false,"SpeakerRefIds":[26,11,68],"TrackRefId":5,"Description":"\"You have an idea, what do you do next?\" Building a Minimum Viable Product is the first step a startup needs to consider. Bogdan, Raluca and Adrian will share their experience gained by working hard for transforming the Marionette Studio idea into the first online animation software for 2D games. They help users accelerate the game development process and save time by reusing character animations."},{"Id":30,"Start":"2016-05-23T14:00:00+0000","End":"2016-05-23T14:45:00+0000","Title":"Games people play during the agile transition ","mock":"","OverrideTracks":false,"SpeakerRefIds":[78],"TrackRefId":5,"Description":"When a company decides to make a transition towards the agility there are many stakeholders: owners, top managers, middle managers, other employees, agile coaches, agile trainers etc. The default assumption is that they share the same transition goals and It would be nice if were true. But what happens when the things are more complex and not everyone (real) needs are considered when creating the transition vision and strategy?"},{"Id":31,"Start":"2016-05-23T08:00:00+0000","End":"2016-05-23T08:45:00+0000","Title":"Self hosted Cloud Storage Solutions - OwnCloud","mock":"","OverrideTracks":false,"SpeakerRefIds":[16],"TrackRefId":6,"Description":"The Presentation consist in a work-shop that present how you can install and configure OwnCloud solution on your very own hardware, and how to use the application instead of using a commercial solution. Every participant will be able to connect on a private custom linux virtual machine and configure his own Cloud solution. The necessary logistics for every participant is a notebook able to connect to internet. The virtual machines will be hosted on a intranet Whiz Center server."},{"Id":32,"Start":"2016-05-23T09:00:00+0000","End":"2016-05-23T09:45:00+0000","Title":"Scala Day by Day ( What means to work with Scala. A story from a previous Java Developer)","mock":"","OverrideTracks":false,"SpeakerRefIds":[51],"TrackRefId":6,"Description":"An introduction to the Scala world seen through the eyes of a Java Developer: challenges, difficulties and the good part of it. This session hopes to introduce everyone (not only java developers) to scala, functional programming and to increase the level of awareness for this technology. "},{"Id":33,"Start":"2016-05-23T10:00:00+0000","End":"2016-05-23T10:45:00+0000","Title":"Spring Data JPA: Get rid of boilerplate DAOs.","mock":"","OverrideTracks":false,"SpeakerRefIds":[33],"TrackRefId":6,"Description":"As a software developer with main focus on Java it's a little bit impossible not dealing with Hibernate and its boiler plate code in DAOs. Spring Data is here to save your time. We will discuss about what is Spring Data, how it works, where it works, its limits and its capabilities and of course a little demo example."},{"Id":34,"Start":"2016-05-23T12:00:00+0000","End":"2016-05-23T12:45:00+0000","Title":"Sayonara Herr Smith. Jumping over cultural barriers in style for effective communi-cation.","mock":"","OverrideTracks":false,"SpeakerRefIds":[65],"TrackRefId":6,"Description":"Effective communication is a challenge in itself, but even more so when we are talking to people from different cultures from allover the world. Knowing the main differences in the way people approach communication in business is essential and directly influences the outcome of the discussion. Some of the topics approached in the presentation include: - first impression. Dressing code and saying hello; - time perception differences; - communication between men and women from different cultures; - attitude towards business and negotiation; - verbal and non-verbal communication. Language and vocabulary, humour, tabus, personal space; - protocol issues. Business dinners, dos and don'ts, gifts All these shall be illustrated with funny or simply embarrassing examples from the personal experience."},{"Id":35,"Start":"2016-05-23T13:00:00+0000","End":"2016-05-23T13:45:00+0000","Title":"Video Streaming apps - what makes them tick","mock":"","OverrideTracks":false,"SpeakerRefIds":[38],"TrackRefId":6,"Description":"What it takes to run the most popular video streaming apps on your platform. What are some of the challenges involved, what about the technologies used and most importantly, how do you connect all the dots. "},{"Id":36,"Start":"2016-05-23T14:00:00+0000","End":"2016-05-23T14:45:00+0000","Title":"Edge Perfor-mance with NewSQL","mock":"","OverrideTracks":false,"SpeakerRefIds":[56],"TrackRefId":6,"Description":"We are going to talk about in-memory NewSQL databases and how they can integrate in your current architecture in order to deliver high performance applications to your users. These can be used as session storage, a cache or a real database. We will talk at least about Memcache, Redis and Aerospike, see where they excel and how you can add them to your existing stack."},{"Id":37,"Start":"2016-05-23T08:00:00+0000","End":"2016-05-23T08:45:00+0000","Title":"The Audacity to Start Up","mock":"","OverrideTracks":false,"SpeakerRefIds":[35],"TrackRefId":7,"Description":"Following the mystical journey from immaculate idea conception to savior product birth, as told by the holy books of entrepreneurship. Reinterpreted locally."},{"Id":38,"Start":"2016-05-23T09:00:00+0000","End":"2016-05-23T09:45:00+0000","Title":"Managing the roadmap. Without a map.","mock":"","OverrideTracks":false,"SpeakerRefIds":[43],"TrackRefId":7,"Description":"What will you work on 6 months from now? What about 3 months from now? Next week? How do you decide which features to include in the product and which to leave for next year? Everyone (clients, users, team members) is asking you to put different things in the product. Most of the time, their interests aren't necessarily aligned. Let's see what can be done to manage all this and create the product that will make you successful."},{"Id":39,"Start":"2016-05-23T10:00:00+0000","End":"2016-05-23T10:45:00+0000","Title":"Fast & Smart Design for Startups","mock":"","OverrideTracks":false,"SpeakerRefIds":[47],"TrackRefId":7,"Description":"Designing a great user experience for your product can sometimes be a lengthy and expensive process. So you need to adapt your mindset in order to make quick and smart decisions every step of the way. How can you capture valuable input from customers and build something they will truly love, while also reducing the time it takes to get your product to market? Let’s learn together how to speed up our product development process without sacrificing quality!"},{"Id":40,"Start":"2016-05-23T12:00:00+0000","End":"2016-05-23T12:45:00+0000","Title":"What it takes to grow an idea into a product","mock":"","OverrideTracks":false,"SpeakerRefIds":[54,63,17],"TrackRefId":7,"Description":"Discover what are the planning and concept phases of Product Design and what it takes to grow and ready a client need for Sprint #0."},{"Id":41,"Start":"2016-05-23T13:00:00+0000","End":"2016-05-23T13:45:00+0000","Title":"Money Talks: How to Fund Your Startup Idea","mock":"","OverrideTracks":false,"SpeakerRefIds":[7],"TrackRefId":7,"Description":"You may think you have to be born in Silicon Valley to be able to raise money, or maybe think it’s easy-peasy and all investors will be blown by your amazing idea and cover you in gold. But reality is different, and you can actually raise money for your startup if you understand how investors think, what they want in exchange for your money, and what other alternatives of funding you have, except guys who want their car doors to open “like this”."},{"Id":42,"Start":"2016-05-23T14:00:00+0000","End":"2016-05-23T14:45:00+0000","Title":"Building and Marketing a SaaS Product - Real Life Case Study","mock":"","OverrideTracks":false,"SpeakerRefIds":[69],"TrackRefId":7,"Description":"Theory Is One Thing, Practice Is Another. In this talk I am going to show how cognitiveSEO and BrandMentions were built & marketed in order to generate awareness and ultimately profit. It's a real life case study on generating an idea, building the product to later start selling it online."},{"Id":43,"Start":"2016-05-23T08:00:00+0000","End":"2016-05-23T08:45:00+0000","Title":"Redux your Flux because you React","mock":"","OverrideTracks":false,"SpeakerRefIds":[10],"TrackRefId":8,"Description":"Redux, Flux, React...they seem to have gained a lot of popularity lately and more and more developers are happy to investigate them. This talk is centred around the architecture that Flux/Redux bring to your application. We will explore the Flux pattern, learn about uni-directional data flow, discuss pros and cons and check out a community's favourite - Redux (a simplification of Flux). Get ready for some good discussions!"},{"Id":44,"Start":"2016-05-23T09:00:00+0000","End":"2016-05-23T09:45:00+0000","Title":"GraphQL & Relay. An alternative to REST APIs","mock":"","OverrideTracks":false,"SpeakerRefIds":[64],"TrackRefId":8,"Description":"A possible solution to current data fetching issues faced by Frontend developers. Two open source projects released by Facebook that offer a different perspective on data management for SPAs. Presentation will provide a basic discussion on architecture with code examples and a demo application."},{"Id":45,"Start":"2016-05-23T10:00:00+0000","End":"2016-05-23T10:45:00+0000","Title":"CSS Architecture in large web apps","mock":"","OverrideTracks":false,"SpeakerRefIds":[42],"TrackRefId":8,"Description":"CSS is simple to understand, but not simple to use or maintain. This presentation will try to raise some issues that large scale web apps are having with organizing, writing and maintaining CSS in a standard manner and will present a few options that we may use (SMACSS, OOCSS, BEM, BEMIT)."},{"Id":46,"Start":"2016-05-23T12:00:00+0000","End":"2016-05-23T12:45:00+0000","Title":"Large-scale websites performance optimisation tricks","mock":"","OverrideTracks":false,"SpeakerRefIds":[48],"TrackRefId":8,"Description":"Practical lessons learned while revamping a US airline website to resist huge Black Friday and Cyber Monday traffic values. Using HTTP status codes and PHP cleverly, we have made parallel requests possible, so that the user experience is greatly enhanced, and we pre-cache resource-consuming user searches. All on a solid Symfony2 foundation."},{"Id":47,"Start":"2016-05-23T13:00:00+0000","End":"2016-05-23T13:45:00+0000","Title":"The State of Web-Based Software Localization","mock":"","OverrideTracks":false,"SpeakerRefIds":[61],"TrackRefId":8,"Description":"Localization (L10n), internationalization (i18n) and globalization (g11n) are fields of growing importance and becoming critical to applications, systems and device developers to offer user experiences in the users' own languages. I will detail the current state of software localization focusing on tools, processes and libraries. There are great challenges still ahead, but there are already in place the foundations to make localization a smooth and efficient experience for both developers and localizers."},{"Id":48,"Start":"2016-05-23T14:00:00+0000","End":"2016-05-23T14:45:00+0000","Title":"About Angular 2","mock":"","OverrideTracks":false,"SpeakerRefIds":[59],"TrackRefId":8,"Description":"Angular 2 is starting to become a thing and you might consider using it for your next project. While many of us wrote Angular 1.x apps, many of us didn't. This presentation aims to introduce the new features of Angular 2 by porting an existing Angular 1 app."},{"Id":49,"Start":"2016-05-23T08:00:00+0000","End":"2016-05-23T08:45:00+0000","Title":"Cayenne - Challenges in Project Management","mock":"","OverrideTracks":false,"SpeakerRefIds":[41],"TrackRefId":9,"Description":"Celemi CayenneTM is a valuable preparation for the challenges of project work. Participants emerge from the experience with: • Better ability to balance the needs of different stakeholder groups. • Identification and utilization of key performance measures. • Heightened ability to read signs and symptoms of potential pitfalls in projects. • Better awareness and preparedness of the conditions for ongoing projects back on the job."},{"Id":50,"Start":"2016-05-23T09:00:00+0000","End":"2016-05-23T09:45:00+0000","Title":"Employee / Team Engagement","mock":"","OverrideTracks":false,"SpeakerRefIds":[12],"TrackRefId":9,"Description":"Let's discuss some research and science about Employee/Team Engagement. What could be some insights that can help all of us to build or transform our teams in engaged teams? What about us, are we engaged? How can this influence our work environment in a positive or negative manner? "},{"Id":51,"Start":"2016-05-23T10:00:00+0000","End":"2016-05-23T10:45:00+0000","Title":"Creative Hacking","mock":"","OverrideTracks":false,"SpeakerRefIds":[3,2],"TrackRefId":9,"Description":"Healthcare has a rich variation of opportunities and problems primed for innovation. Many of the changes likely to happen in health care will be driven by new technologies and data manipulation. Hackmasters specialise in applying creative methods to these areas. We use a number of exercises which are aimed at exposing surprising solutions and shaping them into potential businesses and products. Participants in this session will use ‘Mash-up’ and ‘Idea speed dating’ to form original concepts as well as learn how to use a group’s collective intelligence and to appreciate how and why innovation comes from the outside."},{"Id":52,"Start":"2016-05-23T12:00:00+0000","End":"2016-05-23T12:45:00+0000","Title":"GROWING your architecture in the agile landscape","mock":"","OverrideTracks":false,"SpeakerRefIds":[44,37],"TrackRefId":9,"Description":"Too much up front architecture is considered (for good reasons) waste in agile delivery. Moreover, the existence of the Architect role is a source for continuous debates, as the architecture is emerging from the continuous crowd-effort of the team to burn from the backlog and at the same time ensure the platform is sustaining future change and respecting all sorts of constraints. The session is tackling these concerns, with a focus on key principles and concrete techniques that allow us \"growing\" the right solution instead of just \"building\" it based on an initial (usually error prone) understanding of the context and problem to be solved."},{"Id":53,"Start":"2016-05-23T13:00:00+0000","End":"2016-05-23T13:45:00+0000","Title":"Why Scrum Works - a look beyond practices and values, into our brain","mock":"","OverrideTracks":false,"SpeakerRefIds":[29],"TrackRefId":9,"Description":"Agile principles and values work and that has been proven many times and agile is best known in IT world mostly because of Scrum Framework. But why does Scrum work? Counter intuitive at first, agile principles applied in Scrum become common sense once they are understood. The team is more productive and has more focus, but why? What is beyond the Scrum framework? Join me in this 45 minute session and you will see how Scrum framework was buit to perfectly map the way our brain functions. Also, those attending the session will find a new way to explain Scrum and apply it not only in the IT activities. "},{"Id":54,"Start":"2016-05-23T14:00:00+0000","End":"2016-05-23T14:45:00+0000","Title":"Demystifying Agile - The Complete Idiot's Guide","mock":"","OverrideTracks":false,"SpeakerRefIds":[60],"TrackRefId":9,"Description":"While trying to maintain a funny and dinamic rithm throughout the 45 minutes presentation, the topics covered will debunk some of the most common myths about Agile. Starting from one the most famous quotes by Leonardo da Vinci: \"Simplicity is the ultimate for of sophistication\" I will cover topics like: 1. Agile adoption & transformation issues after 15 years from the Agile Manifesto 2. Agile - The Silver Bullet of Product Development (True of False) 3. The unnecessary complications of old & newer Agile frameworks 4. The completely wrong perception of an Agile Consultant/Trainer/Coach from different perspectives: Management, Clients, Colleagues 5. Many other stuff I haven't thought of yet :-) For any additional info, please feel free to get in touch. "},{"Id":55,"Start":"2016-05-23T08:00:00+0000","End":"2016-05-23T08:45:00+0000","Title":"Changing Mindsets - Learn, Test, Lead [byExample]","mock":"","OverrideTracks":false,"SpeakerRefIds":[19],"TrackRefId":10,"Description":"I often hear people complain about situations, and when they are asked why they don’t do anything about them, they say that there’s nothing they can do. It’s the others that can / have to fix the problems. Not them. Specifically, one aspect that I often hear testers complain about, is that the tester is being seen as the inferior species in the software development environment. When I ask them why they don’t do anything to change this view in their company / project, I get the answer that the managers / developers need to change for this to be fixed. 8 years ago I began a journey to change the mindset on testing, which started with changing my own. My talk is about how I, together with my business partners, managed to change our mindset on testing, to escape the ISTQB land and discover a world full of learning opportunities. It’s about how we managed to create an environment where our colleagues feel good about what they do, want to improve their testing skills and don’t think to change their career in the next 3 years. Our road was not at all smooth. To give just one example, when we thought we had started quite well, in one month we lost 75% of our team. This made us redefine how we hired people, how we trained them and how we worked with them. It also allowed us to learn that sometimes it’s better to let people go. Another important aspect of this journey is how we went beyond our office walls and, together with some fellow testers, started a community for testers in Romania. A place where people can learn from each other, where they can speak up, where they can get feedback from their peers. We started by organising 4 one day peer conferences in the 4 main IT towns in Romania, and tried to plant the community seed. And then we left each seed germinate at its own pace. When they felt ready to flower, we offered support and then allowed them to grow in their own rhythm. Currently monthly meetings are organised in each of the 4 towns with various presentations, exercises, hands-on events, all related to testing. Besides that, community members organise from time to time elaborated workshops on technical topics. This is a story about how I’ve started on this road by working on changing my own mindset and continued by forming a testing community open to learning, where other testers can experience the change themselves as well."},{"Id":56,"Start":"2016-05-23T09:00:00+0000","End":"2016-05-23T09:45:00+0000","Title":"Test Automation using Ruby","mock":"","OverrideTracks":false,"SpeakerRefIds":[74],"TrackRefId":10,"Description":"The test automation world is very wide and narrow at the same time. It is hard to find the right tool, especially that there are lots of expensive and pretty much useless record/playback tools. Ruby is a great dynamic, object oriented language offering great possibilities for automation on multiple levels: system, services/api/db's, desktop and web. On my talk i will cover the following topics: how to get started with Ruby and watir-webdriver, DOM locators - tree of life, code examples, debugging with IRB, BDD techniques with Cucumber and Rspec, Web services automation examples and tools. Feel free to follow me on twitter @sveat0slav"},{"Id":57,"Start":"2016-05-23T10:00:00+0000","End":"2016-05-23T10:45:00+0000","Title":"(In)Security of Embedded Devices' Firmware - Fast and Furious at Large Scale","mock":"","OverrideTracks":false,"SpeakerRefIds":[23],"TrackRefId":10,"Description":"Embedded systems are omnipresent in our everyday life and are becoming increasingly present in many computing and networked environments. For example, they are at the core of various Common-Off-The-Shelf (COTS) devices such as printers, video surveillance systems, home routers and virtually anything we informally call electronics. The emerging phenomenon of the Internet-of-Things (IoT) will make them even more widespread and interconnected. Cisco famously predicted that there will be 50 billion connected embedded devices by 2020. Given those estimations, the heterogeneity of technology and application fields, and the current threat landscape, the security of all those devices becomes of paramount importance. In addition to this, manual security analysis does not scale. Therefore, novel, scalable and automated approaches are needed. In this talk, we present several methods that make *the large scale security analyses of embedded devices* a feasible task. We implemented those techniques in a scalable framework that we tested on real world data. First, we collected a large number of firmware images from Internet repositories and then performed simple static analysis. Second, since embedded devices often expose web interfaces for remote administration, therefore we developed techniques for large scale static and dynamic analysis of such interfaces. Finally, identifying and classifying the firmware files, as well as fingerprinting and identifying embedded devices is difficult, especially at large scale. Using these techniques, we were able to discover a large number of new vulnerabilities in dozens of firmware packages, affecting a great variety of vendors and device classes. We were also able to achieve high accuracy in fingerprinting and classification of both firmware images and live devices. This material is both important and innovative because it addresses the more and more pressing matter of securing/hacking the IoT, hence the embedded devices themselves. Moreover, it's envisioned that the topic will go in the next few years from important to critically important. This material is definitely innovative because it will provide technical aspects of security research by combining several interesting research directions: - non-x86 emulation (and the caveats) - some aspects of static and dynamic analysis - machine learning - device fingerprinting This material is significant because it will present the results, knowledge and insights that resulted from three years of experimentation and work using systematic, methodological and academic approaches. Audience will be presented with technical knowledge, demos, insights, lessons learned and open challenges."},{"Id":58,"Start":"2016-05-23T12:00:00+0000","End":"2016-05-23T12:45:00+0000","Title":"The Testing Map 2.0","mock":"","OverrideTracks":false,"SpeakerRefIds":[30],"TrackRefId":10,"Description":"The testing map is a visual representation of software testing information. It might sound boring but imagine a world where testing information is just one click away. Where information is arrange in such a way that it make sense, that it unlocks the meaning of testing areas that it pops up in your face and let's you know what else you need to learn. "},{"Id":59,"Start":"2016-05-23T13:00:00+0000","End":"2016-05-23T13:45:00+0000","Title":"Why use components in an automation framework ?","mock":"","OverrideTracks":false,"SpeakerRefIds":[27],"TrackRefId":10,"Description":"From my experience, if you want to have a solid support inside the automation framework you'll need to come up with something that enforces the support when building PageObjects. I started considering everything on the page can be considered as a component or functional component and will guide you through these and share my thoughts on how far you can go in your own automation framework if were to build one from scratch or enhance one following some simple \"conventions\". Looking forward hearing your thoughts on this."},{"Id":60,"Start":"2016-05-23T14:00:00+0000","End":"2016-05-23T14:45:00+0000","Title":"Performance Testing in an Agile World","mock":"","OverrideTracks":false,"SpeakerRefIds":[40],"TrackRefId":10,"Description":"I will illustrate - with real life examples - how to execute performance testing in an agile world: challenges, pros, cons, awards. I will talk about collecting performance requirements from the stakeholders ( the hardest task in my experience), creating meaningful testing labs, creating comprehensive test plans, load distribution, execution, analysis of the results ( various methods, not just getting graphs from load runner), optimization ( infrastructure, code, networking) and presenting the performance testing reports to the stakeholders ( another challenging task, since you need to interpret graphs and metrics for non-technical business people) "},{"Id":61,"Start":"2016-05-23T08:00:00+0000","End":"2016-05-23T08:45:00+0000","Title":"Use uncertainty to win business","mock":"","OverrideTracks":false,"SpeakerRefIds":[49,20],"TrackRefId":11,"Description":"When a company fails to win new business, the first thing hurt is the forecasted profit and, out of this, a great deal of collateral damage is made. However, the symptoms appear for the management team usually in other forms and also later in the process. We propose an approach that replace guessing a number with qualitative investigation and produces an end result that is easy to understand and manage. Join the session and see how estimates are transformed into effort and, ultimately, into a coherent story with a price tag attached."},{"Id":62,"Start":"2016-05-23T09:00:00+0000","End":"2016-05-23T09:45:00+0000","Title":"Too small to change the world? Think again!","mock":"","OverrideTracks":false,"SpeakerRefIds":[53,28],"TrackRefId":11,"Description":"In today’s dynamic IT market, more and more projects are global in nature. To survive and succeed in this environment it is important to both understand the dynamics of managing globally distributed projects in a disruptive world and aim to make a difference in the way you interact with your customers and peers. If you want to develop an edge in today’s competitive IT landscape, we will take you on a journey that would allow you to think creatively about the changes you, as an individual can do to tap into new opportunities and remark yourself and your company among the global competitors."},{"Id":63,"Start":"2016-05-23T10:00:00+0000","End":"2016-05-23T10:45:00+0000","Title":"How to split an orange?","mock":"","OverrideTracks":false,"SpeakerRefIds":[25],"TrackRefId":11,"Description":"The presentation is based on a short classical communication story and is thought as an induction in NLP and some of it's linguistic applications in the Project Management world. "},{"Id":64,"Start":"2016-05-23T12:00:00+0000","End":"2016-05-23T12:45:00+0000","Title":"Personal Kanban","mock":"","OverrideTracks":false,"SpeakerRefIds":[21],"TrackRefId":11,"Description":"\"Machines need to be productive, people need to be effective\" - James Benson"},{"Id":65,"Start":"2016-05-23T13:00:00+0000","End":"2016-05-23T13:45:00+0000","Title":"The lean way to require-ments","mock":"","OverrideTracks":false,"SpeakerRefIds":[58,39],"TrackRefId":11,"Description":"“If you think of a product you love, you don’t love it because it was finished on time” (Jeff Patton). In this session we will explore together how to ease the journey from a business proposition to solution specifications. The goal is to test what you think the problem is, before working on the solution."},{"Id":66,"Start":"2016-05-23T14:00:00+0000","End":"2016-05-23T14:45:00+0000","Title":"Sharpshoo-ters","mock":"","OverrideTracks":false,"SpeakerRefIds":[46],"TrackRefId":11,"Description":"Are you a \"maestro\" in reaching designated goals? Do you score 100 out of 100 when measuring the attainment of goals? Are you a sharpshooter? If yes, come to understand if there is more than these goals. If not, come to understand how it starts the journey of setting up the goals. "},{"Id":3001,"Start":"2016-05-23T05:00:00+0000","End":"2016-05-23T05:45:00+0000","OverrideTracks":true,"SpeakerRefIds":[],"TrackRefId":null,"Title":"Registration & Welcome coffee","Description":""},{"Id":3002,"Start":"2016-05-23T05:45:00+0000","End":"2016-05-23T07:30:00+0000","OverrideTracks":true,"SpeakerRefIds":[],"TrackRefId":null,"Title":"Opening + Meet the sponsors","Description":""},{"Id":3003,"Start":"2016-05-23T07:30:00+0000","End":"2016-05-23T08:00:00+0000","OverrideTracks":true,"SpeakerRefIds":[],"TrackRefId":null,"Title":"Break","Description":""},{"Id":3004,"Start":"2016-05-23T09:45:00+0000","End":"2016-05-23T10:00:00+0000","OverrideTracks":true,"SpeakerRefIds":[],"TrackRefId":null,"Title":"Coffee Break","Description":""},{"Id":3005,"Start":"2016-05-23T10:45:00+0000","End":"2016-05-23T12:00:00+0000","OverrideTracks":true,"SpeakerRefIds":[],"TrackRefId":null,"Title":"Lunch break in the restaurant","Description":""},{"Id":3006,"Start":"2016-05-23T14:45:00+0000","End":"2016-05-23T15:00:00+0000","OverrideTracks":true,"SpeakerRefIds":[],"TrackRefId":null,"Title":"The Raffle: Come to Room 2 and Win Your Prizes!","Description":""},{"Id":3007,"Start":"2016-05-23T15:30:00+0000","End":"2016-05-23T19:00:00+0000","OverrideTracks":true,"SpeakerRefIds":[],"TrackRefId":null,"Title":"Cocktail & Business Networking - Partners, Speakers, Special Guests","Description":""},{"Id":3008,"Start":"2016-05-23T19:00:00+0000","End":"2016-05-24T02:00:00+0000","OverrideTracks":true,"SpeakerRefIds":[],"TrackRefId":null,"Title":"The entire CodeCamp community - After party - downtown","Description":""}]}