{
  "Title": "CodeCamp/Iasi, 7 November 2015",
  "Description": "CodeCamp is your local IT community & conference, here in Iasi. It started in 2009 and aims for better communication among the IT people.",
  "ShortName": "CodeCamp/Iasi, 25 October 2014",
  "StartDate": "2015-11-07T08:00:00+0200",
  "EndDate": "2015-11-07T18:00:00+0200",
  "Location": {
    "Id": 1,
    "Name": "Hotel International, Palas, Iasi",
    "Notes": "Hotel International, Palas, Strada Palat 5A, Iași, 700032, Romania",
    "Latitude": 47.154787,
    "Longitude": 27.586702,
    "City": "Iasi"
  },
  "Tracks": [
    {
      "Id": 1,
      "_code": "track1",
      "Name": "Room 1",
      "Notes": "(150 seats, floor -2)"
    },
    {
      "Id": 2,
      "_code": "track2",
      "Name": "Room 2",
      "Notes": "(250 seats, floor -2)"
    },
    {
      "Id": 3,
      "_code": "track3",
      "Name": "Room 3",
      "Notes": "(150 seats, floor -2)"
    },
    {
      "Id": 4,
      "_code": "track4",
      "Name": "Room 4",
      "Notes": "(30 seats, floor -2)"
    },
    {
      "Id": 5,
      "_code": "track5",
      "Name": "Room 5",
      "Notes": "(30 seats, floor -2)"
    },
    {
      "Id": 6,
      "_code": "track6",
      "Name": "Room 6",
      "Notes": "(30 seats, floor -1)"
    },
    {
      "Id": 7,
      "_code": "track7",
      "Name": "Room 7",
      "Notes": "(30 seats, floor -1)"
    },
    {
      "Id": 8,
      "_code": "track8",
      "Name": "Room 8",
      "Notes": "(40 seats, floor 0)"
    },
    {
      "Id": 9,
      "_code": "track9",
      "Name": "Room 9",
      "Notes": "(100 seats, floor 11)"
    },
    {
      "Id": 10,
      "_code": "track10",
      "Name": "Room 10",
      "Notes": "(60 seats, floor 11)"
    }
  ],
  "Speakers": [
    {
      "Id": 1,
      "Name": "Todd Kulick",
      "Title": "VP of Technology, TiVo",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/todd.kulick.jpg",
      "CompanyName": "Ness",
      "CompanyUrl": "",
      "Bio": "Software engineer with fifteen years of experience in building and shipping small, medium, and large scale software products. Detailed experience in embedded DVR/video applications, computer graphics, user interface development, and client-server applications. Prior experience includes design, development, implementation and ongoing support of large scale application deployment working in a large software organization.<br/><br/>Specialties:Interpersonal: Anchoring/building a fun and exciting engineering environment.<br/><br/>Technical: Graphics, video, embedded set-top box development, networking, web technologies, large-scale software engineering, build infrastructure.",
      "FirstName": "Todd",
      "LastName": "Kulick",
      "Code": 73
    },
    {
      "Id": 2,
      "Name": "Arthur Kerpician",
      "Title": "Team Manager",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/arthur.kerpician.jpg",
      "CompanyName": "eMAG",
      "CompanyUrl": "",
      "Bio": "16 years ago he found his first PHP tutorial and instantly fell in love with the „elephant language”. Since then, he worked with as many web technologies he could lay his hands on. Nowadays, he eats PHP for breakfast, Scrum for lunch and enjoys a relaxing Symfony during dinner. ",
      "FirstName": "Arthur",
      "LastName": "Kerpician",
      "Code": 73
    },
    {
      "Id": 3,
      "Name": "Luigi Lauro",
      "Title": "IT Architect",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/luigi.lauro.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Enterprise Architect and Senior Software Analyst and Developer with wide experiences in services, application and web development (Java, Scala, .NET, C/C++, most scripting languages), databases, networks, operating systems (FreeBSD, Mac OS X, Linux, Windows), hardware and software security (parallel computing and cryptology are some of his main interests).<br/><br/>Started coding at 10, and began working at 14 as a freelance software developer, and since then he has never stopped. Luigi has a long and proven experience of successful deliveries of challenging projects (from small companies to big enterprises in several fields, such as banking), where he has acted over the years in almost any available role: project manager, technology consultant, architect, analyst, developer.<br/><br/>Over the years he has participated as an acknowledged expert and speaker at various technical conferences around the world, and he's always interested in getting his hands dirty on ground breaking, technology-driven and challenging projects, especially if scala, java and/or open frameworks are involved.<br/><br/>Since 2011 he has been working as a Lead Technical Architect for UniCredit Business Integrated Solutions, global service company of UniCredit group.",
      "FirstName": "Luigi",
      "LastName": "Lauro",
      "Code": 73
    },
    {
      "Id": 4,
      "Name": "Andrei Postolache",
      "Title": "Trainer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/andrei.postolache.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "I’m a co-founder and trainer at Introspecials with a focus on modern organizations, leadership, agility, lean, learning, culture and communication.<br/><br/>My previous experience is that of a business leader with P&L responsibilities for Endava’s 300 people strong Iasi business unit, of which I was the first employee. <br/><br/>I have also taken a keen interest in the local communities, having been a speaker at various local, national and international conferences, on various leadership topics. <br/><br/>See more about my company at introspecials.com. You can find a summary of my public speaking on my slideshare page. I am a cofounder of the local community thehumansidegroup.com. My personal blog is on medium and I’ve recently started a collaboration with clasabusiness.ro. My original background is in software development and architecture.",
      "FirstName": "Andrei",
      "LastName": "Postolache",
      "Code": 73
    },
    {
      "Id": 5,
      "Name": "Florin Cardasim",
      "Title": "Codecamper",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/florin.cardasim2015.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Florin leads the Architecture and Analysis discipline in Endava. Beyond his technical skills, Florin has gained a broad experience as a trainer for companies and speaker in community events. Florin is also co-founder of CodeCamp, one of the largest communities of software developers in Romania.",
      "FirstName": "Florin",
      "LastName": "Cardasim",
      "Code": 73
    },
    {
      "Id": 6,
      "Name": "Mihai Alexandru Bîrsan",
      "Title": "Software Development Manager",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/mihai.birsan.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Passionate about front-end technologies and the web. Codes by night, manages brilliant engineers by day. Still believes boring problems should be automated away through coding. Looks for interesting problems to solve with other skills.",
      "FirstName": "Mihai",
      "LastName": "Alexandru Bîrsan",
      "Code": 73
    },
    {
      "Id": 7,
      "Name": "Archit Lohokare",
      "Title": "Senior Director, Platform Product Management",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/archit.lohokare.jpg",
      "CompanyName": "Optymyze",
      "CompanyUrl": "",
      "Bio": "Archit Lohokare is the Senior Director of Platform Product Management at Optymyze, the market leader in Sales Performance Management. Prior to this, he was the Director of Product Management for Symantec's Cloud Information Protection security as a service. Before Symantec, Archit managed IBM's market leading Access Management product line comprising of web access management, identity federation, enterprise single sign-on, risk-based access and entitlements management products. Archit joined IBM through the acquisition of Encentuate, a leading Bay Area startup in the security space, of which he was an early member. At Encentuate, Archit held roles in the engineering, professional services, support, and pre-sales organizations. Archit has an MBA from UC Berkeley-Haas School of Business and a Bachelors degree in Computer Engineering from NTU, Singapore where he was awarded the SIA-NOL undergraduate scholarship by the Ministry of Education, Singapore.",
      "FirstName": "Archit",
      "LastName": "Lohokare",
      "Code": 73
    },
    {
      "Id": 8,
      "Name": "Steven Arnauts",
      "Title": "Software Architect",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/StevenArnauts.jpg",
      "CompanyName": "Expert Network",
      "CompanyUrl": "",
      "Bio": "Software architect, designer and developer. I’ve been working as a consultant for ISV’s designing SAAS applications for the last couple of years, with a primary technological focus on the .NET platform.",
      "FirstName": "Steven",
      "LastName": "Arnauts",
      "Code": 73
    },
    {
      "Id": 9,
      "Name": "Ralf Geenen",
      "Title": "Software Architect",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/RalfGeenen.jpg",
      "CompanyName": "Expert Network",
      "CompanyUrl": "",
      "Bio": "Ralf has more than 17 years of experience in IT. During his professional career, he has worked as a software architect for multiple Belgian customers in the financial, utilities, public, healthcare and other sectors. He focuses on software design and methodology.",
      "FirstName": "Ralf",
      "LastName": "Geenen",
      "Code": 73
    },
    {
      "Id": 10,
      "Name": "Sebastian Agachie",
      "Title": "Ethical Hacker, Security Specialist",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/sebastian.agachie.jpg",
      "CompanyName": "Centric",
      "CompanyUrl": "",
      "Bio": "Sebastian believes that curiosity, motivation and the right attitude are the key ingredients of achieving everything you want. Although in his career Sebastian covered almost every position in IT, from networking to development, he always had an incredible passion for security. <br/><br/>His courage and motivation plus Centric adaptive horizons were the key fundamental aspects of the new security department that was created in Centric Romania. Aside from coordinating and keeping the security department in RO synchronized with Centric BV, Sebastian is driving through security operations such as: pen tests, security advices and awareness for developers/testers/managers throw a various series processes.",
      "FirstName": "Sebastian",
      "LastName": "Agachie",
      "Code": 73
    },
    {
      "Id": 11,
      "Name": "Elger Jonker",
      "Title": "Ethical Hacker, Security Lead",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/elger.jonker.jpg",
      "CompanyName": "Centric",
      "CompanyUrl": "",
      "Bio": "Elger believes the world is a better place when knowledge, research and joy are shared. Therefore he has helped establish several hackerspaces in the Netherlands, is active in a foundation that shares the joy of retro gaming and helps organizing the world’s biggest outdoor hacker conference in 2017.<br/><br/>Elgers passion for world improvement also translates to Centric, where he is leading the security implementation. Aside from giving clear insights into the needs for security, Elger performs security tests, sets standards (based on standards), shares knowledge, builds a dedicated security team and shares his vision that Centric and trust must stay synonymous.",
      "FirstName": "Elger",
      "LastName": "Jonker",
      "Code": 73
    },
    {
      "Id": 12,
      "Name": "Jozua Velle",
      "Title": "Unit Manager Storeworld",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/jozua.velle.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Jozua Velle<br/>Unit manager of a 5 distributed scrum teams (Belgium-Romania) working on a front- and backoffice solution for mid/large scale retailers. Focused on aligning the entire organisation with modern software development concepts.",
      "FirstName": "Jozua",
      "LastName": "Velle",
      "Code": 73
    },
    {
      "Id": 13,
      "Name": "Dan Vulpe",
      "Title": "Software Engineer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/dan.vulpe.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Proud father of two and passionate software engineer with a strong focus on code quality and low technical debt.",
      "FirstName": "Dan",
      "LastName": "Vulpe",
      "Code": 73
    },
    {
      "Id": 14,
      "Name": "Vlad Zelinschi (Reign)",
      "Title": "UI Tech Lead",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/vlad.zelinschi.reign.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Vlad (close friends call him Reign :D) is a Frontend Engineer with a strong passion for the latest technologies out there and an unhealthy obsession for clean and simple code. He loves to try out things as soon as they hit the market so he always keeps an eye out for the JS, CSS and HTML everchanging landscapes. He happily embraces any challenge, though he’ll prefer the ones related to Angular, React, FRP, Node, MongoDB and frontend performance. He is currently employed at Appsbroker where he leads the frontend team and drives innovation forward.",
      "FirstName": "Vlad",
      "LastName": "Zelinschi (Reign)",
      "Code": 73
    },
    {
      "Id": 15,
      "Name": "Alex Mang",
      "Title": "CEO",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/alex.mang.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Alex Mang is a regular speaker at community driven events focusing mostly on cloud-computing topics, thus aiming to help developers better understand the implications of cloud-computing as a whole. As an Azure Advisor, he regularly offers Azure teams in Redmond feedback on upcoming Azure features and services and gets to test them out in early development stages.<br/>Alex dedicates most of his time developing his BizSpark Plus start-up, KeyTicket Solutions, a software development company involved in the event management and ticketing industry, where he gets to work with some of the biggest event organizers in Romania. He also invests lots of time teaching software architectural patterns and cloud computing development at user groups and forums around Europe. Whenever he doesn’t write articles in the monthly TechWiki magazine, he develops and publishes open-source Azure-related libraries (e.g. Azure Search Client) on CodePlex or in Git repositories.<br/>During his 10 year career as a software developer he got the chance to work on both hardware and software projects using Microsoft and Microsoft-related technologies on all platforms imaginable: embedded, robotics, desktop, mobile and web.",
      "FirstName": "Alex",
      "LastName": "Mang",
      "Code": 73
    },
    {
      "Id": 16,
      "Name": "Radu Iscu",
      "Title": "Solution Architect",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/radu.iscu2.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Radu has been a software professional for a while now. He's worked on both small and large projects, small and large companies, and in this time he's learned a lot of stuff about code. He's passionate about extreme programming, flexible design, emergent architecture and refactoring, to the point where he won't stop talking about it.",
      "FirstName": "Radu",
      "LastName": "Iscu",
      "Code": 73
    },
    {
      "Id": 17,
      "Name": "Silviu Eigel",
      "Title": "Team Leader",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/silviueigel.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Team leader for a FOREX trading platform with a focus on online payment processing.",
      "FirstName": "Silviu",
      "LastName": "Eigel",
      "Code": 73
    },
    {
      "Id": 18,
      "Name": "Alex Michel",
      "Title": "Chief Architect",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/alex.michael.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Architect, mentor, software design and development lead in Financial Services. Design and development of real time trading products, risk management applications, online payment processing and back office tools. Full product life cycle management and support.",
      "FirstName": "Alex",
      "LastName": "Michel",
      "Code": 73
    },
    {
      "Id": 19,
      "Name": "Anghel Adrian-Claudiu",
      "Title": "Developer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/anghelclaudiu.jpg",
      "CompanyName": "Unicredit",
      "CompanyUrl": "",
      "Bio": "n/a",
      "FirstName": "Anghel",
      "LastName": "Adrian-Claudiu",
      "Code": 73
    },
    {
      "Id": 20,
      "Name": "Butnariu Cristi",
      "Title": "Senior Programmer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/butnariu.cristi.png",
      "CompanyName": "BeeNear",
      "CompanyUrl": "",
      "Bio": "I'm a passionate and enthusiastic software developer working on BeeNear, with a 10+ years experience in building software for retail markets from abroad using Microsoft technologies.<br/> For the last 2 years I start focusing on mobile hybrid applications and on emerging web technologies and frameworks.<br/> I have a passion for discovering new ways to improve myself, to learn from others and, why not, to share my experience with others.",
      "FirstName": "Butnariu",
      "LastName": "Cristi",
      "Code": 73
    },
    {
      "Id": 21,
      "Name": "Sorin Peste",
      "Title": "Technical Evangelist, Microsoft Romania",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/sorin.peste.jpg",
      "CompanyName": "Microsoft",
      "CompanyUrl": "",
      "Bio": "Sorin has been a part of the Enterprise Services unit within Microsoft Romania since 2011, and has been busy developing software on the Microsoft technology stack since 2001. Recently he has taken on the Technical Evangelist role and will engage more actively with developers and IT Professionals, showcasing the newest Microsoft solutions and technology.<br/><br/>In his current role as well as previous ones, he has been part of delivering a number of enterprise solutions, both on premises and in the cloud. <br/><br/>Sorin likes coding, travelling and riding his motorcycle in his spare time. ",
      "FirstName": "Sorin",
      "LastName": "Peste",
      "Code": 73
    },
    {
      "Id": 22,
      "Name": "Cezar Romaniuc",
      "Title": "Senior Java Developer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/cezar.romaniuc.jpg",
      "CompanyName": "Endava",
      "CompanyUrl": "",
      "Bio": "I’m a Software Developer with over 4 years of experience in building Java based solutions related to payment, digital media, telecommunications, energy and ERP systems.<br/><br/>Over the past few years I’ve been part of various teams on different projects that gave me the possibility to develop and consolidate my technical knowledge.",
      "FirstName": "Cezar",
      "LastName": "Romaniuc",
      "Code": 73
    },
    {
      "Id": 23,
      "Name": "Remus Langu",
      "Title": "Design Lead",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/remus_langu.png",
      "CompanyName": "Endava",
      "CompanyUrl": "",
      "Bio": "Remus is a software engineer with a high interest in Agile practices (XP, BDD/TDD, Emergent Design,…) and Software Craftsmanship.<br/>He is excited about writing clean code and making the complex simple.<br/>He is also passionate about sustainable systems, free energy and permaculture.<br/>Remus is a continuous learner, an Orthodox Christian, a husband, a father, a free thinker and he enjoys learning from others and helping others with what he has learned and experienced.",
      "FirstName": "Remus",
      "LastName": "Langu",
      "Code": 73
    },
    {
      "Id": 24,
      "Name": "Bogdan Litescu",
      "Title": "Owner",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/bogdan.litescu.jpg",
      "CompanyName": "DNN Sharp",
      "CompanyUrl": "",
      "Bio": "Bogdan Litescu is a software developer and business geek, balancing strategy and execution in product development for over 12 years. His skill set is at the intersection of business, customer and technical worlds. For DNN Sharp which he’s running, this translates into high tech software products that provide brilliantly simple solutions to real problems and unparalleled support. There's no surprise that the company is at the top of the DNN ecosystem. Inside the community, Bogdan is seen as the quiet guy with a vision to transform DNN into a next generation platform.",
      "FirstName": "Bogdan",
      "LastName": "Litescu",
      "Code": 73
    },
    {
      "Id": 25,
      "Name": "Raluca Breaur",
      "Title": "Delivery Manager",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/raluca.breaur.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Raluca is an Agile enthusiast with 12 years of experience in software development.<br/>Loving change, she had various roles from java developer, manager, focusing now on agile transformations.",
      "FirstName": "Raluca",
      "LastName": "Breaur",
      "Code": 73
    },
    {
      "Id": 26,
      "Name": "Ovidiu Simionica",
      "Title": "Technical Project Manager",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/ovidiu.simionica.jpg",
      "CompanyName": "Fortech",
      "CompanyUrl": "",
      "Bio": "Passionate about code quality practices, Object Oriented Design, TDD and 'Uncle Bob\"<br/>14 Years Software Developer mainly Java but also C and C++.<br/>5 years of technical leadership , adept of collaborative management and self organizing teams",
      "FirstName": "Ovidiu",
      "LastName": "Simionica",
      "Code": 73
    },
    {
      "Id": 27,
      "Name": "Mihai Bura",
      "Title": "Web Developer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/mihai.bura.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Being an eager learner and tech savvy, Mihai is helping Yonder deliver the best front end experience for their customers. He enjoys challenging mentees to learn and discover new ways of building the web.",
      "FirstName": "Mihai",
      "LastName": "Bura",
      "Code": 73
    },
    {
      "Id": 28,
      "Name": "Doina Movila",
      "Title": "Social Media Analyst",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/doina.movila.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "https://ro.linkedin.com/pub/doina-movila/a0/474/86a",
      "FirstName": "Doina",
      "LastName": "Movila",
      "Code": 73
    },
    {
      "Id": 29,
      "Name": "Ancuta Damian",
      "Title": "Project manager",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/ancuta.damian.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "I'm an IT enthusiast interested in Agile methodologies and understanding how improving human interactions in a team can lead to better results.",
      "FirstName": "Ancuta",
      "LastName": "Damian",
      "Code": 73
    },
    {
      "Id": 30,
      "Name": "Mircea Pricop",
      "Title": "Software Engineer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/mircea.pricop.jpg",
      "CompanyName": "Google",
      "CompanyUrl": "",
      "Bio": "I joined Google fresh off the benches of the University of Hamburg, where I transferred to after starting my CS education right here in Iasi. Having been at Google for three years now, I'm currently focusing on information extraction, aggregation and data understanding as part of developing exciting new search features.",
      "FirstName": "Mircea",
      "LastName": "Pricop",
      "Code": 73
    },
    {
      "Id": 31,
      "Name": "Bogdan Bujdea",
      "Title": "Windows Platform Developer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/bogdan.bujdea.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "I'm a Windows Platform Developer with ~4 years of experience. I worked at Thinslices as a Windows 8 Developer, and now I work at Feel IT as Windows Phone developer. Considering that Windows 10 is only one platform now, I think my correct title would be Windows Platform Developer.<br/><br/>Although my main focus is on C# and UWP apps, I also worked with a lot of languages like Java, Node.js, Angular.js, HTML5/CSS3.<br/><br/>One of my favorite authors and speakers is Robert Martin(Uncle Bob). I learned from him a lot of things like Test Driven Development, writing clean code, and the most important one, being a professional developer.",
      "FirstName": "Bogdan",
      "LastName": "Bujdea",
      "Code": 73
    },
    {
      "Id": 32,
      "Name": "Bianca Ionel",
      "Title": "IT Specialist",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/bianca.ionel.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Roxana Bianca Ionel works as IT Specialist for Expert Moldova Trading. She develops websites in Magento, Prestashop and Wordpress, and relaxes doing some design, but she's strong interest is Magento. After she took the degree in Informatica Economica, 3 years ago, she fall in love with Magento, and their relationship is more stronger every day. During her free time she likes to write on her professional blog (http://www.biancaionel.com/blog) tutorials for programmers.",
      "FirstName": "Bianca",
      "LastName": "Ionel",
      "Code": 73
    },
    {
      "Id": 33,
      "Name": "Daniel Leon",
      "Title": "Senior Software Developer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/leon.daniel.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "I'm a Linux enthusiast and a proactive learner. I like finding the best solutions and putting them into practice.",
      "FirstName": "Daniel",
      "LastName": "Leon",
      "Code": 73
    },
    {
      "Id": 34,
      "Name": "Radu Danciu",
      "Title": "Senior Entertainment Engineer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/radu.danciu.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "With over 7 years of experience in game development having shipped a couple of triple-A titles my goal is to provide memorable experiences to people who enjoy games.",
      "FirstName": "Radu",
      "LastName": "Danciu",
      "Code": 73
    },
    {
      "Id": 35,
      "Name": "Robert Tamas",
      "Title": "Develpment Lead",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/robert_tamas.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "IT professionals with a keen interest in software full delivery life-cycle aimed at offering best value given the right contextual approach, practices and methodologies.",
      "FirstName": "Robert",
      "LastName": "Tamas",
      "Code": 73
    },
    {
      "Id": 36,
      "Name": "Dragos Tudorache",
      "Title": "Develpment Lead",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/dragos_tudorache.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "IT professionals with a keen interest in software full delivery life-cycle aimed at offering best value given the right contextual approach, practices and methodologies.",
      "FirstName": "Dragos",
      "LastName": "Tudorache",
      "Code": 73
    },
    {
      "Id": 37,
      "Name": "Paul Istoan",
      "Title": "Software Development Engineer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/paul.istoan.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Paul is a software developer who's been slowly realizing that writing software is not that easy. From working on legacy projects to designing <br/>a product from scratch, through deployment and maintenance, Paul has been trying to figure out why some software is so easy to work with while other software is virtually unmodifiable. A diverse professional career underlined by curiosity and a desire to share have currently brought<br/>him to Iasi where he works at Amazon as a Software Development Engineer.",
      "FirstName": "Paul",
      "LastName": "Istoan",
      "Code": 73
    },
    {
      "Id": 38,
      "Name": "George Serediuc",
      "Title": " Digital Designer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/george.serediuc.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "I’m a multidisciplinary designer striving to create great experiences. My favorite things include unfiltered beer, science fiction novels, cosmology, and hiking. Currently designing positive outcomes at figshare. Follow me: @georgeserediuc",
      "FirstName": "George",
      "LastName": "Serediuc",
      "Code": 73
    },
    {
      "Id": 39,
      "Name": "Antonio Caciuc",
      "Title": "HackerSpace Pilot",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/caciuc.mihai.antonio.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Just a guy, working towards a future when the things that make us weak and strange get engineered away.",
      "FirstName": "Antonio",
      "LastName": "Caciuc",
      "Code": 73
    },
    {
      "Id": 40,
      "Name": "Ciprian Redinciuc",
      "Title": "iOS Developer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/ciprian.redinciuc.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "I'm a passionate iOS developer with a taste for fine crafted mobile apps. <br/>Always on the look for what's new on the market and",
      "FirstName": "Ciprian",
      "LastName": "Redinciuc",
      "Code": 73
    },
    {
      "Id": 41,
      "Name": "Andrei Pruteanu",
      "Title": "Software engineer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/andrei.pruteanu.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "I am information processing specialist at Uber Research. My work focuses on performing complex data analysis on large research publication data-sets. <br/><br/>Previously I was software architect at NXP Semiconductors and Post-Doctoral Research Scientist at the Embedded Software Group, Faculty of Electrical Engineering, Mathematics and Computer Science (EEMCS), Delft University of Technology, the Netherlands. <br/><br/>I received my PhD in Computer Science from Delft University of Technology, the Netherlands, my Masters degree in Computer Science from the University of Iasi, Romania and my Bachelor degree in telecom. engineering from the Technical University of Iasi, Romania.",
      "FirstName": "Andrei",
      "LastName": "Pruteanu",
      "Code": 73
    },
    {
      "Id": 42,
      "Name": "Ionut Grecu",
      "Title": "Scrum Master",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/ionut.grecu.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Ionut Grecu has been involved in IT for the last 6+ years. His work exists at the intersection of Agile Transformation, Lean Thinking, Psychology and Digital Marketing. Weird, right? He is a believer in servant leadership and the power that Agile and Lean thinking and techniques can bring to an organization. Being a bookish sort who always loves a mental challenge, he would be bored if he wasn’t constantly learning. Yet he has the ability to focus and research deeply in a narrow field of specialization. Life's big questions interest him most. DNN Sharp is his oyster and when he is out of the office you can find him eating shawarma, sitting at a table near you. He has a self-proclaimed PhD in napping in any position you can think of.",
      "FirstName": "Ionut",
      "LastName": "Grecu",
      "Code": 73
    },
    {
      "Id": 43,
      "Name": "Horia Popa",
      "Title": "Software Development Manager",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/horia.popa.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "I started my career as a C/C++ developer, worked on various projects using various technologies. Now, after having developed software for the likes of Nokia, Intel, Volkswagen and others I find myself on the management side for TiVo - a Silicon Valley based company. I am currently also a partner in a local company, iColdo.",
      "FirstName": "Horia",
      "LastName": "Popa",
      "Code": 73
    },
    {
      "Id": 44,
      "Name": "Hrubaru Ana-Maria",
      "Title": "Software Engineering Manager @Optymyze",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/hrubaru.ana-maria.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "10+ years experience in the testing process in different software development models at all the testing levels.<br/>Now taking the challenge of managing a great team to deliver high quality solutions.<br/>Looking forward to share with you some of this experience.",
      "FirstName": "Hrubaru",
      "LastName": "Ana-Maria",
      "Code": 73
    },
    {
      "Id": 45,
      "Name": "Ciprian Ouatu",
      "Title": "Trainer, Consultant",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/ciprian.ouatu.jpg",
      "CompanyName": "Ascendis Consulting",
      "CompanyUrl": "",
      "Bio": "Ciprian is specialised in facilitating communication, management and sales programs, and he does this with responsibility, involvement and humour. He always wants to learn new things and is passionate about education, reading, photography and music. He is a part of ASCENDIS, the No. 1 company in developing people and organisations.",
      "FirstName": "Ciprian",
      "LastName": "Ouatu",
      "Code": 73
    },
    {
      "Id": 46,
      "Name": "Ioana Serediuc",
      "Title": "Test Lead",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/ioana.serediuc.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "•\t9 years’ experience in testing field<br/>•\t7 years leadership experience as a Test Lead and Test Manager in web applications, application virtualization, database management and database management tools<br/>•\tExperienced with Agile as a tester and SCRUM Master.<br/>•\tExperience with leading testing teams, working with complex products, creating test strategy, approaches and planning.<br/>•\tBackground in Economics fields and 5 years’ experience as an accountant",
      "FirstName": "Ioana",
      "LastName": "Serediuc",
      "Code": 73
    },
    {
      "Id": 47,
      "Name": "Alexandru Pascariu",
      "Title": "Automation QA",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/alexandrupascariu.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "- software developer - Centric IT Solutions<br/> - QA - Endava<br/> - currently Automation QA - Yonder",
      "FirstName": "Alexandru",
      "LastName": "Pascariu",
      "Code": 73
    },
    {
      "Id": 48,
      "Name": "Bogdan Florea",
      "Title": "Senior Java Developer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/bogdanflorea.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "- Java developer -The Red Point, Pentalog and Yonder<br/>- currently Java Cluster Manager - Yonder",
      "FirstName": "Bogdan",
      "LastName": "Florea",
      "Code": 73
    },
    {
      "Id": 49,
      "Name": "Cristian Coțoi",
      "Title": "SDET",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/cristian.cotoi.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Cristian has almost 8 years of experience in testing, and currently working as a Software Developer in Test @Amazon. He has been part of many projects, both small and big, and in this time he learned a lot about quality and testing, tools and principles and the space in-between.",
      "FirstName": "Cristian",
      "LastName": "Coțoi",
      "Code": 73
    },
    {
      "Id": 50,
      "Name": "Andreea Popescu",
      "Title": "QA Engineer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/andreea.popescu.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "I'm a curious QA Engineer at Zitec, passionate about photography, reading, science and learning. ",
      "FirstName": "Andreea",
      "LastName": "Popescu",
      "Code": 73
    },
    {
      "Id": 51,
      "Name": "Diana Lefter",
      "Title": "IT Manager",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/diana.lefter.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "IT Manager born and raised in Iasi, with 18 years of experience in US  and Canada, where she effectively implemented various offshore/onshore resource staffing models (India). An advocate for retaining IT talent in Romania, where she wants to apply her management and leadership knowledge. She is relocating back to Romania, with the strong belief that our country is becoming an outsourcing destination for corporations all over the world. Come and hear her emigration and repatriation story.",
      "FirstName": "Diana",
      "LastName": "Lefter",
      "Code": 73
    },
    {
      "Id": 52,
      "Name": "Nechita Radu",
      "Title": "Training partner Mentor Training",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/RaduNechita.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Radu Marian Nechita - training partner<br/><br/>Energetic, professional and experienced trainer and consultant with 11 years of career in the financial services industry, both as manager and trainer and 20-year experience in goods and services selling, Radu has a relevant background in team diagnosis and development, organizational culture analysis, business coaching and selling skills including communication, negotiation, presentations, management and training. He worked in developing and delivering programs for industries like: banking, communication, life insurance, construction, measurement technologies, automotives, pharmaceutical, tourism, IT&C, FMCG. Trainer and manager for ING Romania and Citibank Romania.",
      "FirstName": "Nechita",
      "LastName": "Radu",
      "Code": 73
    },
    {
      "Id": 53,
      "Name": "Cristi Ursachi",
      "Title": "Entrepreneur",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/cristi.ursachi.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "I have been developing software for global enterprises since 2003 mainly using Microsoft technologies and I was involved in all phases of building a product from planning, architecture and development till deployment and maintenance. On the other side I was always passionate and interested about low-level implementations of software, especially databases.As result I founded his start-up and I'm working now on CryptonorDB, a product that will change the way of using a database in the cloud.",
      "FirstName": "Cristi",
      "LastName": "Ursachi",
      "Code": 73
    },
    {
      "Id": 54,
      "Name": "George Raut",
      "Title": "Analytics Specialists Leader",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/george.raut.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "https://ro.linkedin.com/in/georgeraut<br/><br/>https://ro.linkedin.com/in/bogdansuchar<br/><br/>https://ro.linkedin.com/pub/oana-andreea-scutarasu/46/503/131/en",
      "FirstName": "George",
      "LastName": "Raut",
      "Code": 73
    },
    {
      "Id": 55,
      "Name": "Bogdan Suchar",
      "Title": "Account Manager",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/bogdan.suchar.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "https://ro.linkedin.com/in/georgeraut<br/><br/>https://ro.linkedin.com/in/bogdansuchar<br/><br/>https://ro.linkedin.com/pub/oana-andreea-scutarasu/46/503/131/en",
      "FirstName": "Bogdan",
      "LastName": "Suchar",
      "Code": 73
    },
    {
      "Id": 56,
      "Name": "Oana Scutarasu",
      "Title": "Marketing Automation Team Leader",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/oana.scutarasu.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "https://ro.linkedin.com/in/georgeraut<br/><br/>https://ro.linkedin.com/in/bogdansuchar<br/><br/>https://ro.linkedin.com/pub/oana-andreea-scutarasu/46/503/131/en",
      "FirstName": "Oana",
      "LastName": "Scutarasu",
      "Code": 73
    },
    {
      "Id": 57,
      "Name": "Camelia Codarcea",
      "Title": "Cofounder AgileHub",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/camelia.codarcea.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Agile Consultant, Trainer and Coach<br/>Cofounder AgileHub<br/>Coiwner Anticafe AgileHub",
      "FirstName": "Camelia",
      "LastName": "Codarcea",
      "Code": 73
    },
    {
      "Id": 58,
      "Name": "Corneliu Constantin FATULESCU",
      "Title": "cofounder AgileHub",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/cornel.fatulescu.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Agile coach, father, CTO of Pentalog Group, co-founder of AgileHub and manager at Pentalog Institute, Cornel FĂTULESCU is a passionate agile coach & trainer. With an incredible portfolio in IT Services and 15 years of experience, Cornel ventures Pentalog Institute in the challenging world of IT consultancy. As an agile advocate, he optimized business value delivered within various large scale organizations by implementing XP, Scrum and Kanban. “In my opinion, involvement in agile communities is like witnessing the inevitable metamorphosis of companies continuously progressing until the educational big bang occurs”. This is mainly the reason why Cornel co-created AgileHub in Brașov, probably the most dynamic Agile IT community in Romania, where he is a very important knowledge contributor.",
      "FirstName": "Corneliu",
      "LastName": "Constantin FATULESCU",
      "Code": 73
    },
    {
      "Id": 59,
      "Name": "Vasile Putină",
      "Title": "Agile Coach & trainer. Agile transition program coordinator.",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/vasile.putina.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Agile Coach. Agile transition program coordinator at Pentalog.<br/>His passion for agility and coaching has helped many teams and clients to maximize the value delivered to end users. Being 15 years in IT, it managed to achieve a multilateral vision of this field through experience as lecturer, programmer in different languages, Scrum Master, manager, agile trainer and coach. In his opinion, agility is about people and their ability to overcome the limits being guided by a set of values.<br/>",
      "FirstName": "Vasile",
      "LastName": "Putină",
      "Code": 73
    },
    {
      "Id": 60,
      "Name": "Mitrofan Marius",
      "Title": "Application Support Lead",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/marius_mitrofan.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Google Apps Certified Administrator with full background knowledge of the following key technologies :<br/>* Scripting : Javascript, Apps Script<br/>* Development : Java, Javascript<br/>* Cloud platforms : Google Cloud/AppEngine, Office365/Azure, Amazon EC2<br/><br/>Key attributes :<br/>✓ fast learner<br/>✓ computer enthusiast<br/>✓ communicative<br/>✓ responsible<br/>✓ analytical thinking",
      "FirstName": "Mitrofan",
      "LastName": "Marius",
      "Code": 73
    },
    {
      "Id": 61,
      "Name": "Dirla Vasile",
      "Title": "Activiti Core Developer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/dirla.vasile.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Senior Java Developer with more than 10 years experience in web application development. <br/>An enthusiastic Open Source advocate and contributor in different open source projects.<br/>",
      "FirstName": "Dirla",
      "LastName": "Vasile",
      "Code": 73
    },
    {
      "Id": 62,
      "Name": "Adrian-Tudor Panescu",
      "Title": "Web Enthusiast",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/adrian.tudor.panescu.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Computer Science graduate and Web enthusiast. From small Berlin startups to large institutions like CERN, I've always pushed my limits in order to deliver innovative Web products.",
      "FirstName": "Adrian-Tudor",
      "LastName": "Panescu",
      "Code": 73
    },
    {
      "Id": 63,
      "Name": "Cristian Falcas",
      "Title": "Dev-Ops",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/icon_user.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "I'm 36 years old, born in Iasi and working for almost 3 years as a dev-ops engineer at Optymyze/Synygy/ArezzoSky.<br/><br/>I have a passion for linux. I love to automate as much as possible from my work.",
      "FirstName": "Cristian",
      "LastName": "Falcas",
      "Code": 73
    },
    {
      "Id": 64,
      "Name": "Florin Asavoaie",
      "Title": "Senior Devops Engineer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/florin.asavoaie.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Florin is an IT and computer security enthusiast. He’s got experience with the automated deployment and configuration of medium to large environments dedicated to web applications and web services. He is a fan of Open Source communities and promotes the use of Open Source software in business environments.",
      "FirstName": "Florin",
      "LastName": "Asavoaie",
      "Code": 73
    },
    {
      "Id": 65,
      "Name": "Cosmin Ilie",
      "Title": "Cloud Services Manager",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/cosmin.ilie.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "I lead the Cloud Services Group in Iasi for Optymyze. Our job is to operate the company's SaaS platform for a large group of clients in different data centers and geographic locations. ",
      "FirstName": "Cosmin",
      "LastName": "Ilie",
      "Code": 73
    },
    {
      "Id": 66,
      "Name": "Alexandru-Cristian Balmuș",
      "Title": "R&D Engineer",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/alexandru-cristian.balmus.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Alex has been an R&D engineer for 7 years. Besides software development he also had occasional coordinating and training responsibilities. He is excited about the enterprise – open source synergy, multi-platform development technologies and, above all, he enjoys helping others to learn about these.",
      "FirstName": "Alexandru-Cristian",
      "LastName": "Balmuș",
      "Code": 73
    },
    {
      "Id": 67,
      "Name": "Florin Ciubotaru",
      "Title": "Technical Lead",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/florin.ciubotaru.png",
      "CompanyName": "Pentalog",
      "CompanyUrl": "",
      "Bio": "Florin is an engineer with an interest in building complex systems with high impact. He experiments with various leadership forms and is interested in various human factors surrounding information systems. He is currently fulfilling his passion as a Tech Lead at Pentalog.",
      "FirstName": "Florin",
      "LastName": "Ciubotaru",
      "Code": 73
    },
    {
      "Id": 68,
      "Name": "Adrian Rindasu",
      "Title": "Managing Partner",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/adrian.rindasu2.jpg",
      "CompanyName": "EDUROM",
      "CompanyUrl": "",
      "Bio": "Adrian co founded Edurom in 2002. Since then, he developed and delivered training and consultancy programs for various companies in the software development industry. He is running Belbin & Situational Leadership trainings for the IT&C clients of Edurom.",
      "FirstName": "Adrian",
      "LastName": "Rindasu",
      "Code": 73
    },
    {
      "Id": 69,
      "Name": "Ovidiu Avasilcai",
      "Title": "Technical Project Manager",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/ovidiu.avasilcai.png",
      "CompanyName": "SCC",
      "CompanyUrl": "",
      "Bio": "Technical Project Manager with a background in IT services. Over the years I've had the pleasure of working in many areas of IT service industry, from customer/tech support, devops, dba, project coordination and development.<br/>I have an interest in frontend development and the open source communities that have evolved around it.",
      "FirstName": "Ovidiu",
      "LastName": "Avasilcai",
      "Code": 73
    },
    {
      "Id": 70,
      "Name": "Alex Morarasu",
      "Title": "Quality Manager",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/alexmurarasu.jpg",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Welcome the challenge of solving problems. With 10+ years of experience on different QA roles I look forward for new opportunities and challenges. Highly competitive, very ambitious, highly motivated, self-starter who is organized, disciplined, goal – oriented, willing to work hard to reach my objectives. I am a team person, very sociable and communicative. Excellent communication skills demonstrated by ability to work with people of diverse backgrounds. Listen to determine needs of customers before offering a solution. Quickly establish rapport with clients.",
      "FirstName": "Alex",
      "LastName": "Morarasu",
      "Code": 73
    },
    {
      "Id": 71,
      "Name": "Codecamper",
      "Title": "",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/icon_user.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "",
      "FirstName": "",
      "LastName": "",
      "Code": 73
    },
    {
      "Id": 72,
      "Name": "Coffeemaker",
      "Title": "",
      "PortraitImageUrl": "http://iasi.codecamp.ro/images/speakers/icon_coffee.png",
      "CompanyName": "",
      "CompanyUrl": "",
      "Bio": "Relax, meet your friends and enjoy a cup of coffee, I'll be there too. ;)",
      "FirstName": "",
      "LastName": "",
      "Code": 73
    }
  ],
  "Sessions": [
    {
      "Id": 1,
      "Start": "2015-11-07T09:00:00+0000",
      "End": "2015-11-07T09:45:00+0000",
      "Title": "New architecture design: Micro services and Continuous Integration",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        19
      ],
      "TrackRefId": 1,
      "Description": "The presentation will focus around new architecture trends and issues regarding continuous integration."
    },
    {
      "Id": 2,
      "Start": "2015-11-07T10:00:00+0000",
      "End": "2015-11-07T10:45:00+0000",
      "Title": "Stories from the aviation industry",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        67
      ],
      "TrackRefId": 1,
      "Description": "Most of us use air travel and expect it to work perfectly. Did you ever wonder what are the IT challenges surrounding planes, airports and air traffic control? Join us as we have a look at a few information systems from the aviation industry."
    },
    {
      "Id": 3,
      "Start": "2015-11-07T11:00:00+0000",
      "End": "2015-11-07T11:45:00+0000",
      "Title": "The Blackening",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        2
      ],
      "TrackRefId": 1,
      "Description": "Take part to the most amazing Black Friday experience, behind the scenes, director's cut edition. I'll walk you through eMAG's Black Friday jurney, from 404 and 500 errors to 100% uptime, from 21 servers to over 120.  The Blackening movie will start from Black Friday's birthplace during the late 1800's, we'll move to eMAG's first experience with this event, draw the curtain on our past and current infrastructure, disclose some of the amazing technologies we're using and show the order's jurney through kilometers of fiber optics, terabytes of RAM and peta flops of CPU.  By the way, you'll also have the chance to ask the ultimate question: are the price errors for real?"
    },
    {
      "Id": 4,
      "Start": "2015-11-07T13:00:00+0000",
      "End": "2015-11-07T13:45:00+0000",
      "Title": "Living the end times",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        26
      ],
      "TrackRefId": 1,
      "Description": "It is the about the imminent change of mentality that our local IT industry must make. It is metaphorically referring to the end times of the \"coder as a resource\" age. The transition has begun  quite a while ago with large adoption of Agile Manifesto.  14 years later after the print and time is up for the \"typical\" outsourcing developer. The economical turmoil will not be forgiving with those companies that are not truly people oriented and with those of us that are not professional. It is the new time of Software Craftsmanship."
    },
    {
      "Id": 5,
      "Start": "2015-11-07T14:00:00+0000",
      "End": "2015-11-07T14:45:00+0000",
      "Title": "All you need to know about mutation testing",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        35,
        36
      ],
      "TrackRefId": 1,
      "Description": "Be our guest for a session on the interesting concept of Mutation Testing. Let’s explore together: What is Mutation testing? How can we easily adopt it in our projects? What is the added value?   Target Audience: Our session is aimed at developers but any other “flavor” is welcome.  We are looking forward to meet you there, Dragos & Robert "
    },
    {
      "Id": 6,
      "Start": "2015-11-07T15:00:00+0000",
      "End": "2015-11-07T15:45:00+0000",
      "Title": "Service Bus Integration Patterns",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        18,
        17
      ],
      "TrackRefId": 1,
      "Description": "We will go through an example of leveraging MassTransit's Saga concept to create a scalable distributed online payment system."
    },
    {
      "Id": 7,
      "Start": "2015-11-07T09:00:00+0000",
      "End": "2015-11-07T09:45:00+0000",
      "Title": "Cloud Security for the new Digital and SaaS Enterprise ",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        7
      ],
      "TrackRefId": 2,
      "Description": "In today’s digital age, enterprises and their lines of businesses are increasingly adopting the cloud not just for their internal applications and the infrastructure that hosts those applications to boost their bottom line, but also to engage with their own customers and positively impact their top line. This digital and cloud transformation of their businesses brings for a myriad of security and compliance challenges for the organization. In this session, the speaker delves into these challenges and discusses aspects of the cloud security and compliance architectures these enterprises should consider and invest in as they embark on the cloud journey. "
    },
    {
      "Id": 8,
      "Start": "2015-11-07T10:00:00+0000",
      "End": "2015-11-07T10:45:00+0000",
      "Title": "Security Going Wrong",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        10,
        11
      ],
      "TrackRefId": 2,
      "Description": "In this presentation, we will discuss about the role and importance of security in our day to day activities in IT and also we will take a brief look at the artistic ways of security going wrong. We know that security is becoming an increasingly important concern in our development area, since most of the application are taking the world wide web path, being accessible over networks and are, as result, vulnerable to a wide variety of threats. In order to minimize the possibility of unauthorized code to access our application and manipulate sensitive data there were build security measures and routines."
    },
    {
      "Id": 9,
      "Start": "2015-11-07T11:00:00+0000",
      "End": "2015-11-07T11:45:00+0000",
      "Title": "Haxe - A solution for the big UI rewrite",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        1
      ],
      "TrackRefId": 2,
      "Description": "I'll discuss the basics of what Haxe is, what makes it interesting for software development and why and how we use it at TiVo to make better products faster."
    },
    {
      "Id": 10,
      "Start": "2015-11-07T13:00:00+0000",
      "End": "2015-11-07T13:45:00+0000",
      "Title": "REST, Event-Driven Architecture and Micro-Services",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        8,
        9
      ],
      "TrackRefId": 2,
      "Description": "Today, REST is probably the most popular communication style for Web APIs, but there are other styles to consider when designing a scalable, flexible, and maintainable software system. We will share a number of best practices on using REST, event-driven architecture and micro-services."
    },
    {
      "Id": 11,
      "Start": "2015-11-07T14:00:00+0000",
      "End": "2015-11-07T14:45:00+0000",
      "Title": "Java Developers: how to go from 5 to 9 (A journey through the best and hidden features that came over to Java in the last decade)",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        3
      ],
      "TrackRefId": 2,
      "Description": "Title: Java Developers: how to go from 5 to 9 Summary: A journey through the best and hidden features that came over to Java in the last decade   Java is surely not the first programming language that comes to mind when we talk about innovation and fancy new shining features, especially if you compare it to the likes of modern functional languages as Haskell, Scala, F#, or even C#.   Despite this, in the last 10+ years java language designers and java libraries developers have been very busy trying to push the most relevant and most needed tools to evolve it in the right direction, while keeping intact the core ‘spirit’: that stability, quality and consistency that everyone in the IT world knows and appreciate.   However, as developers in the cold real world out there, unluckily we have to deliver projects rather than play with language features.   This is why, more often than not, most of these new features go severely under-utilized, sometimes even completely ignored by developers, newbies and ‘veterans’ alike.   Of course, this is surely due also to that inherent lag in adopting newer version of the JVM in the enterprise that we all know about. Nevertheless if we are honest, that is not the full picture: we also have to blame ourselves, and our often static mindset to stick to what we know already and have been using in the past, rather than looking for a newer, better way to do things.   I will try to motivate you to refresh your java skills, by having a short journey over the last 10 years in Java development, going through each new version of Java SE (6, 7, 8), to see some of the best and/or most hidden features that came along with each new java release.   Meanwhile, we will also get a glimpse of what will come and what the the future holds for us with Java 9."
    },
    {
      "Id": 12,
      "Start": "2015-11-07T15:00:00+0000",
      "End": "2015-11-07T15:45:00+0000",
      "Title": "How we did it! 100+ continuous deployments per day… while having a coffee",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        12,
        13
      ],
      "TrackRefId": 2,
      "Description": "Getting frequent releases into production is not straight forward. Changing a complex software suite release frequency from 1-2 major releases per year to 8-10 releases per year is more complex. Add multiple customers on different versions and configurations to this puzzle and things turn to be really complex. Join this talk and get to know the challenges for Continuous Delivery and our approach for solving this puzzle. "
    },
    {
      "Id": 13,
      "Start": "2015-11-07T09:00:00+0000",
      "End": "2015-11-07T09:45:00+0000",
      "Title": "Voice Technology in Warehousing",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        20
      ],
      "TrackRefId": 3,
      "Description": "Until recently, the idea of holding a conversation with a computer seemed pure science fiction.  But things are changing, and quickly. A growing number of people now talk to their mobile smart phones, asking them to send e-mail and text messages, search for directions, or find information on the Web. Now the rapid rise of powerful mobile devices is making voice interfaces even more useful and pervasive. Speech is ideally suited to mobile computing because a single spoken command can accomplish tasks that would normally require a multitude of swipes and presses. In this presentation we will try to see how we can make a mobile hybrid application driven by voice commands, using technologies like Apache Cordova mobile development framework, HTML5, Javascript and Google Voice Recognition API."
    },
    {
      "Id": 14,
      "Start": "2015-11-07T10:00:00+0000",
      "End": "2015-11-07T10:45:00+0000",
      "Title": "Non-Native Mobile Apps",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        6
      ],
      "TrackRefId": 3,
      "Description": "You've built a great web app! It even works offline! The logical next step is to make it work on your smartphone.  Let's walk through what through 3 important aspects to really call it mobile: you want it to be responsive, you want to use system-level functions and you want it well packaged.  (PS. In this talk, I'll brush the surface of what it takes to make a web app work well on the mobile, and try to send you in the right direction. If you want to roll up your sleeves and create one right away, I recommend you attend Mihai Bura's talk about Ionic, at 11am in Room 4.)"
    },
    {
      "Id": 15,
      "Start": "2015-11-07T11:00:00+0000",
      "End": "2015-11-07T11:45:00+0000",
      "Title": "Flux(Redux) architecture & ReactJS ecosystem",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        69
      ],
      "TrackRefId": 3,
      "Description": "Introductory presentation on FLUX and the React ecosystem. How Flux came to be and why you might prefer it over MVC/MVVM.   Demo application using ReactJS & Redux (FLUX library)  "
    },
    {
      "Id": 16,
      "Start": "2015-11-07T13:00:00+0000",
      "End": "2015-11-07T13:45:00+0000",
      "Title": "Client-side reactive programming with RxJS",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        14
      ],
      "TrackRefId": 3,
      "Description": "Imperative programming. We're all used to that. Probably doing it since...forever. But it's not the only way we can reason about our applications. In this presentation we will embark on a journey through the land of reactive programming. What it is and why is it useful. What are the advantages as well as the perks of using it, and when should we consider taking this approach. All this while live coding a GitHub suggestion box using RxJS (probably the most well-known client-side JS reactive programming framework). Hope to see you there!"
    },
    {
      "Id": 17,
      "Start": "2015-11-07T14:00:00+0000",
      "End": "2015-11-07T14:45:00+0000",
      "Title": "Developer Guide to Founding a Startup",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        24
      ],
      "TrackRefId": 3,
      "Description": "If you feel your potential as a software developer could be wasted then the right thing to do is to leave the comfort zone and start your own gig. I’ll share with you the lessons I learnt in my 10 year journey of being a developer and running a business in Romania. Learn about choosing an idea, establishing a legal entity, choosing technologies and tools, adopting the lean startup mindset, bootstrapping or attracting investments and more."
    },
    {
      "Id": 18,
      "Start": "2015-11-07T15:00:00+0000",
      "End": "2015-11-07T15:45:00+0000",
      "Title": "Building a real time analytic dashboard using Azure Event Hubs, Stream Analytics, Machine Learning, and PowerBI",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        21
      ],
      "TrackRefId": 3,
      "Description": "Come see a demo of a real time analysis of data at motion, using a host of Azure-based technologies.  Find out how you can easily build a pipeline to ingest, transform, predict and present data and trends, using stuff that’s already in Azure today.  Learn how you can get from idea to working prototype in a very short time. "
    },
    {
      "Id": 19,
      "Start": "2015-11-07T09:00:00+0000",
      "End": "2015-11-07T09:45:00+0000",
      "Title": "Build apps using a zero-knowledge cloud database",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        53
      ],
      "TrackRefId": 4,
      "Description": "Data privacy is a fundamental problem nowadays. Many organizations and individuals are concerned about privacy and what can happen with their data stored in the cloud. In this session will see how you can practically build apps using a cloud database which knows nothing about the data stored, but at the same time being able to query it."
    },
    {
      "Id": 20,
      "Start": "2015-11-07T10:00:00+0000",
      "End": "2015-11-07T10:45:00+0000",
      "Title": "Integrating Cortana in UWP apps",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        31
      ],
      "TrackRefId": 4,
      "Description": "Cortana is the voice-controlled virtual assistant launched on Windows Phone 8.1. Since its release, it has improved alot, gaining more and more features, especially when Windows 10 was launched. My goal in this presentation is to show you how easy it is to integrate Cortana in UWP apps, while also making sure that the apps run on various Windows 10 devices. Although you can write UWP apps in many languages, I will use C#/XAML in this presentation."
    },
    {
      "Id": 21,
      "Start": "2015-11-07T11:00:00+0000",
      "End": "2015-11-07T11:45:00+0000",
      "Title": "Ionic - A framework for mobile development",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        27
      ],
      "TrackRefId": 4,
      "Description": "Mobile development done right needs to cover at least a number of areas.   Prototyping - Use customizable block-like components Development - Write the backbone of your application using AngularJS and ngCordova Build and Emulate - A strong CLI will help you build your app using Gulp and then emulate it either in the browser, emulator, or on your very own device Deploy - One-click-deploy to your device? Yup, that's possible Analytics - Learn about the people using your app with less effort  Ionic comes to help and puts in our hands a beautiful framework that keeps us focused at what we should be doing: develop amazing apps."
    },
    {
      "Id": 22,
      "Start": "2015-11-07T13:00:00+0000",
      "End": "2015-11-07T13:45:00+0000",
      "Title": "Know Your Customers, Know Your Apps",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        15
      ],
      "TrackRefId": 4,
      "Description": "Whether you have to prioritize user stories on your backlog, learn what the best ways to monetize your applications are or simply want to find what the errors your customers are referring to, monitoring your applications is key if you want to be successful in the ISV industry. And yet too many applications, once deployed, remain unmonitored and thus, their developers tend to behave passive when it comes to supporting their customers. Ever heard a developer say ‘I don’t know why it doesn’t work for you. It works perfectly fine on my PC.’? During this session I’ll walk you through the best practices of both implementing and using Azure Application Insights so that you will be two steps ahead of your customer and eventually get to be pro-active when it comes to supporting applications deployed in the wild."
    },
    {
      "Id": 23,
      "Start": "2015-11-07T14:00:00+0000",
      "End": "2015-11-07T14:45:00+0000",
      "Title": "45 minutes Magento tour",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        32
      ],
      "TrackRefId": 4,
      "Description": "1. Why Magento? 2. Orange rules 3. Scary errors and quick fix 3. SEO mistakes 5. Security tips"
    },
    {
      "Id": 24,
      "Start": "2015-11-07T15:00:00+0000",
      "End": "2015-11-07T15:45:00+0000",
      "Title": "Blue Chip Companies and their Social Media Tactics in Sales",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        28
      ],
      "TrackRefId": 4,
      "Description": "It's no secret that the sales world has changed and Social Media is the name of the new 'Sales Game'. Although it can still be a mystery for regular Jane's and Joe's, Blue Chip Companies already rely on social media tactics on how to maintain or gain more in Sales."
    },
    {
      "Id": 25,
      "Start": "2015-11-07T09:00:00+0000",
      "End": "2015-11-07T09:45:00+0000",
      "Title": "Spark: The beginnings",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        33
      ],
      "TrackRefId": 5,
      "Description": "Are you a Java developer interested in big data processing and never had the chance to work with Apache Spark ? My presentation aims to help you get familiar with Spark concepts and start developing your own distributed processing application. "
    },
    {
      "Id": 26,
      "Start": "2015-11-07T10:00:00+0000",
      "End": "2015-11-07T10:45:00+0000",
      "Title": "Distributed processing of large datasets",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        22
      ],
      "TrackRefId": 5,
      "Description": "This presentation will give an overview of the Big Data trends in processing large datasets using NoSQL databases and cluster computing frameworks that can run applications faster than Hadoop by keeping data in memory."
    },
    {
      "Id": 27,
      "Start": "2015-11-07T11:00:00+0000",
      "End": "2015-11-07T11:45:00+0000",
      "Title": "Use your data to understand the world: extracting meaning out of free form text and beyond.",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        30
      ],
      "TrackRefId": 5,
      "Description": "Word embeddings are one of the most exciting topics in machine learning today, and thanks to recent developments it's never been easier to harness their power.  Starting from a simple problem, we'll have a look at how and why they work, see them in action on the Google cloud, then peek at how these concepts can be help you with your own challenges."
    },
    {
      "Id": 28,
      "Start": "2015-11-07T13:00:00+0000",
      "End": "2015-11-07T13:45:00+0000",
      "Title": "How to grow happy teams",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        29
      ],
      "TrackRefId": 5,
      "Description": "We've all worked, at one point or another, as part of a team. Sometimes the experience was pleasant and some other times not. Let's explore how much can one person influence, why some teams never glue together and what are the key attributes of genuinely happy teams. "
    },
    {
      "Id": 29,
      "Start": "2015-11-07T14:00:00+0000",
      "End": "2015-11-07T14:45:00+0000",
      "Title": "How to improve individual performance",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        57,
        58
      ],
      "TrackRefId": 5,
      "Description": "I've made various presentations about boosting the skills of a manager, of a Scrum Master or a developer. During this presentation I'll speak about the common framework and the required mind-set that stands behind individual improvement"
    },
    {
      "Id": 30,
      "Start": "2015-11-07T15:00:00+0000",
      "End": "2015-11-07T15:45:00+0000",
      "Title": "The hidden impediments to agile adoption",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        59
      ],
      "TrackRefId": 5,
      "Description": "“In my case agile is not applicable\". What is really behind these words? It could be lack of knowledge, time or budget. Or there is, perhaps, a special context which needs an individual approach. I think there is something else, more interesting and deeper. Let's investigate this topic together."
    },
    {
      "Id": 31,
      "Start": "2015-11-07T09:00:00+0000",
      "End": "2015-11-07T09:45:00+0000",
      "Title": "Handling Variations in Emerging Designs",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        23
      ],
      "TrackRefId": 6,
      "Description": "One thing that Agile Software Development manifesto promises and values more is 'Responding to change over following a plan'. Achieving this value by properly handling variations within the problem domain is one of the biggest challenges. In this talk I will share some techniques from Emergent Design that I use when dealing with changes."
    },
    {
      "Id": 32,
      "Start": "2015-11-07T10:00:00+0000",
      "End": "2015-11-07T10:45:00+0000",
      "Title": "Writing Maintainable JavaScript",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        37
      ],
      "TrackRefId": 6,
      "Description": "With a growing set of front-end technologies and a constant demand for new features from the customer, many developers are having a hard time keeping their project organized and flexible. Unperceptibly, what used to be a small and easily manageable collection of components becomes a mass of indecipherable legacy code. Luckily, these types of problems are not new, and the industry literature is abundant with materials on the topic, albeit oftentimes for other technologies. In this talk, Paul brings some of these proven solutions to the JavaScript world, providing the audience with real-world examples of managing code complexity to ensure developers keep sane and new features get shipped in reasonable time."
    },
    {
      "Id": 33,
      "Start": "2015-11-07T11:00:00+0000",
      "End": "2015-11-07T11:45:00+0000",
      "Title": "ECMAScript 6 Tips & Traps",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        62
      ],
      "TrackRefId": 6,
      "Description": "JavaScript has always been a language with quite a few dark corners and gotchas, which, if ignored, could lead to unexpected behaviours and bugs.  While the new ECMAScript standard has helped clear some of these issues, it has also brought up some new ones like the Temporal Dead Zone, handling exceptions in Promises, or the behaviour of constants. This interactive presentation will go through a number of ECMAScript 6 quirks, in an attempt to clear them up."
    },
    {
      "Id": 34,
      "Start": "2015-11-07T13:00:00+0000",
      "End": "2015-11-07T13:45:00+0000",
      "Title": "GPGPU Procedural Content Generation",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        34
      ],
      "TrackRefId": 6,
      "Description": "An overview of techniques used to offload the workload of content generation to the GPU using Compute Shaders.  While of direct interest to game developers, the talk also touches on more general aspects of interacting with massive parallel architectures, useful in other areas of computing."
    },
    {
      "Id": 35,
      "Start": "2015-11-07T14:00:00+0000",
      "End": "2015-11-07T14:45:00+0000",
      "Title": "A short introduction to VR",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        43
      ],
      "TrackRefId": 6,
      "Description": "A short introduction to some concepts of VR and basic information on how to write a software that creates VR from individual movie clips."
    },
    {
      "Id": 36,
      "Start": "2015-11-07T15:00:00+0000",
      "End": "2015-11-07T15:45:00+0000",
      "Title": "Marketing Automation Distillery",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        54,
        55,
        56
      ],
      "TrackRefId": 6,
      "Description": "As a fine distillery transforms raw fruits into a premium blend, this is how Marketing Automation converts simple web visitors into loyal customers. Our analogy should make it easier to understand the journey through the backstage of the automated and entertaining part of Marketing. You will witness the behavior of a potential customer as he becomes a business opportunity."
    },
    {
      "Id": 37,
      "Start": "2015-11-07T09:00:00+0000",
      "End": "2015-11-07T09:45:00+0000",
      "Title": "Creative Programming",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        39
      ],
      "TrackRefId": 7,
      "Description": "Make art with computer programming"
    },
    {
      "Id": 38,
      "Start": "2015-11-07T10:00:00+0000",
      "End": "2015-11-07T10:45:00+0000",
      "Title": "About User Experience: How design became the new language of business",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        38
      ],
      "TrackRefId": 7,
      "Description": "As people now expect beautiful, well-designed product experiences, we are witnessing a design-driven revolution around the world. We will find out how human factors considerations are increasingly being incorporated into the product design process. I will also talk about airports in order to better emphasise the power of fierce focus on customer-centric product design. My vision is that our products and experiences should be purposeful and human-centered."
    },
    {
      "Id": 39,
      "Start": "2015-11-07T11:00:00+0000",
      "End": "2015-11-07T11:45:00+0000",
      "Title": "Emotional Intelligence - A Success Mantra for Agile Teams",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        42
      ],
      "TrackRefId": 7,
      "Description": "You’re a developer, a tester, or a business analyst, a person with feelings, ideas, and values just like everyone else. And while you know that you are fully qualified and prepared for this position, nobody told you that working on an Agile team requires a shift in your mindset, nobody warned you about the emotional side of being in charge. There is no preparing for finding emotional serenity or being emotionally intelligent when you work in an Agile team. There is no certificate to earn, no pill to take to make the rough feelings that slow you down, hold you back, making you less productive go away. You’re on your own. It is never easy. And how you react to your emotions will have profound consequences for your team.   I invite you to join me in a journey of self-exploration and discovery to learn some practical ways to look at your own behavior within the context of the team and gain self-understanding and insight into your behavior and how this behavior affect your team members. "
    },
    {
      "Id": 40,
      "Start": "2015-11-07T13:00:00+0000",
      "End": "2015-11-07T13:45:00+0000",
      "Title": "Lessons learned in starting and closing an IT company in Holland",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        41
      ],
      "TrackRefId": 7,
      "Description": "The presentation is a lessons-learned session about starting and closing(failing) an IT company in Holland. It will be an interactive discussion about do's and don't's that I learned during such a process. Practical examples will be shown about technology, marketing and financing. "
    },
    {
      "Id": 41,
      "Start": "2015-11-07T14:00:00+0000",
      "End": "2015-11-07T14:45:00+0000",
      "Title": "Activiti - The workflow engine of your application",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        61
      ],
      "TrackRefId": 7,
      "Description": "This is intended to be an introductory presentation for java developers interested in workflow execution engines.  We'll start with some basic information about BPMN concepts and then we'll continue with modelling an simple process in Activiti.  Later the developers will see how Activiti could be used as a workflow engine for their applications."
    },
    {
      "Id": 42,
      "Start": "2015-11-07T15:00:00+0000",
      "End": "2015-11-07T15:45:00+0000",
      "Title": "Intro to Alfresco Development",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        66
      ],
      "TrackRefId": 7,
      "Description": "Alfresco is the leading enterprise - open source content management system (a filed that’s much more interesting than it sounds :). It’s also an awesome platform for building custom ECM solutions. This presentation will introduce you to Alfresco development approaches using Java and JavaScript."
    },
    {
      "Id": 43,
      "Start": "2015-11-07T09:00:00+0000",
      "End": "2015-11-07T09:45:00+0000",
      "Title": "Useful code metrics",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        16
      ],
      "TrackRefId": 8,
      "Description": "Code metrics are important. They offer us quantitative and qualitative information about our software, or so we've been told.  In this presentation we'll be talking about a few useless metrics and a few more useful ones that will help us more about understanding our code, and the tools we can use to get them."
    },
    {
      "Id": 44,
      "Start": "2015-11-07T10:00:00+0000",
      "End": "2015-11-07T10:45:00+0000",
      "Title": "Automate your failures. A story about docker and kubernetes.",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        63
      ],
      "TrackRefId": 8,
      "Description": "What is docker, how it works and how it compares with virtualization techniques. How kubernetes is automating docker containers and how the focus changed from keeping an application up as log as possible, to how to replace a misbehaving application as soon as possible."
    },
    {
      "Id": 45,
      "Start": "2015-11-07T11:00:00+0000",
      "End": "2015-11-07T11:45:00+0000",
      "Title": "Configuration Management NG",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        64
      ],
      "TrackRefId": 8,
      "Description": "An idea on how we could revolutionize configuration management and bring it to the next level, providing real configuration flexibility and unlimited possibilities to scale."
    },
    {
      "Id": 46,
      "Start": "2015-11-07T13:00:00+0000",
      "End": "2015-11-07T13:45:00+0000",
      "Title": "How to \"Go\"",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        65
      ],
      "TrackRefId": 8,
      "Description": "This talk will provide a short introduction to the Go Programing language developed by Google and share some of the lessons learned at Optymyze during one year of developing tools in go.   Hopefully by the end of this talk you should learn why we choose Go, why we’ve rewritten a large part of our own internal tools in go and why should you invest time in learning go. "
    },
    {
      "Id": 47,
      "Start": "2015-11-07T14:00:00+0000",
      "End": "2015-11-07T14:45:00+0000",
      "Title": "Continuos Delivery for iOS Projects",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        40
      ],
      "TrackRefId": 8,
      "Description": "Learn how to connect all you deployment tools into one streamlined workflow and start saving development hours by using fastlane. Whether you are testing your latest commit, making a build for your beta testers or even delivering to the AppStore, fastlane has all the right moves for you."
    },
    {
      "Id": 48,
      "Start": "2015-11-07T15:00:00+0000",
      "End": "2015-11-07T15:45:00+0000",
      "Title": "DevOps on Google's Compute Engine",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        60
      ],
      "TrackRefId": 8,
      "Description": "1) Google Compute Engine capabilities 2) Monitor Instances with Google Cloud Monitoring 3) Automate code deployment "
    },
    {
      "Id": 49,
      "Start": "2015-11-07T09:00:00+0000",
      "End": "2015-11-07T09:45:00+0000",
      "Title": "Testing Under Way",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        44
      ],
      "TrackRefId": 9,
      "Description": "The development of the Testing market in Iasi in the last 10 years and the future challenges."
    },
    {
      "Id": 50,
      "Start": "2015-11-07T10:00:00+0000",
      "End": "2015-11-07T10:45:00+0000",
      "Title": "Building frameworks over Selenium",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        49
      ],
      "TrackRefId": 9,
      "Description": "Selenium is the leading tool for web automation. But with a custom framework over it, you can really get the most of it.  We will take a deep look through the ways we can build a framework over Selenium, best practices and loads of solid examples."
    },
    {
      "Id": 51,
      "Start": "2015-11-07T11:00:00+0000",
      "End": "2015-11-07T11:45:00+0000",
      "Title": "How real are your test leadership abilities?",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        46
      ],
      "TrackRefId": 9,
      "Description": "This presentation touches upon subjects like: what are the most important skills and areas of expertise for a test lead and how technical a test lead role should be."
    },
    {
      "Id": 52,
      "Start": "2015-11-07T13:00:00+0000",
      "End": "2015-11-07T13:45:00+0000",
      "Title": "[1 - Bring IT back home] [2- From zero to hero with Quality Assurance]",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        51,
        70
      ],
      "TrackRefId": 9,
      "Description": "[1 - IT Manager born and raised in Iasi, with 18 years of experience in US  and Canada, where she effectively implemented various offshore/onshore resource staffing models (India). An advocate for retaining IT talent in Romania, where she wants to apply her management and leadership knowledge. She is relocating back to Romania, with the strong belief that our country is becoming an outsourcing destination for corporations all over the world. Come and hear her emigration and repatriation story.] [2 - How often did you hear someone saying \"QA is cool\"? How often have you been encouraged to continue as a QA engineer? With this presentation I'm trying to give some answers to the above questions (and more) by using my 10+ years of QA experience and real life examples.]"
    },
    {
      "Id": 53,
      "Start": "2015-11-07T14:00:00+0000",
      "End": "2015-11-07T14:45:00+0000",
      "Title": "Wisdom is the bug killer",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        50
      ],
      "TrackRefId": 9,
      "Description": "This presentation can be summarized in how awesome is the QA Engineer's job and in the same time, how complex it is. In this presentation you will find about a really \"human\" testing framework and the importance of multiple knowledge in daily testing."
    },
    {
      "Id": 54,
      "Start": "2015-11-07T15:00:00+0000",
      "End": "2015-11-07T15:45:00+0000",
      "Title": "How to write “Software that matters” using BDD concepts on Java platform",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        47,
        48
      ],
      "TrackRefId": 9,
      "Description": "General presentation on BDD (Behaviour-Driven Development) concepts from the perspective of an Automation QA and a Java developer. BDD tools: Cucumber and JBehave."
    },
    {
      "Id": 55,
      "Start": "2015-11-07T09:00:00+0000",
      "End": "2015-11-07T09:45:00+0000",
      "Title": "Lean - change the game",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        25,
        5
      ],
      "TrackRefId": 10,
      "Description": "We'll explore the Lean ecosystem and wonder how we can change the game"
    },
    {
      "Id": 56,
      "Start": "2015-11-07T10:00:00+0000",
      "End": "2015-11-07T10:45:00+0000",
      "Title": "Decide at the Last Responsible Moment!",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        5,
        25
      ],
      "TrackRefId": 10,
      "Description": "[Workshop] - Decisions in software architecture & design can be tricky in the complex and agile environments we live. Decide too early or too late and unexpected (sometimes very serious) consequences may arise. Let's explore real options and the Last Responsible Moment!"
    },
    {
      "Id": 57,
      "Start": "2015-11-07T11:00:00+0000",
      "End": "2015-11-07T11:45:00+0000",
      "Title": "Thinking Strategically",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        68
      ],
      "TrackRefId": 10,
      "Description": "This presentation challenges leaders to broaden their perspectives, and question conventional wisdom. Participants will be able to: - Describe what strategic thinking is and how it differs from strategic planning and execution - Recognize and demonstrate the characteristics and behaviors of strategic thinkers - Identify and overcome the barriers that impede strategic thinking"
    },
    {
      "Id": 58,
      "Start": "2015-11-07T13:00:00+0000",
      "End": "2015-11-07T13:45:00+0000",
      "Title": "Team Synergy",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        45
      ],
      "TrackRefId": 10,
      "Description": " In this experiential learning work-shop we will realize that we need to build trust-based relationships, we will understand that ‘winning’ often requires some partners to be prepared to ‘step aside’ or even sacrifice in order to allow another partner to ‘win’. The more competitive a business landscape becomes, the more we need our teams to operate in a trustful way."
    },
    {
      "Id": 59,
      "Start": "2015-11-07T14:00:00+0000",
      "End": "2015-11-07T14:45:00+0000",
      "Title": "The coaching role on employee retention and individual performance",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        52
      ],
      "TrackRefId": 10,
      "Description": "Radu will demonstrate how to use the Coaching in seven steps method to access employee qualities and enhance them for performance. It will be not only a presentations but managers from audience will exercise practically the method and they will be able to use it next day with their employees. The manager do not have to like or dislike people, nor to change them, but to find and enhance their qualities for individual performance and as a team. You can not be a performer if your team do not perform."
    },
    {
      "Id": 60,
      "Start": "2015-11-07T15:00:00+0000",
      "End": "2015-11-07T15:45:00+0000",
      "Title": "Lucruri de care mi-e frică, și cele de care nu",
      "mock": "",
      "OverrideTracks": false,
      "SpeakerRefIds": [
        4
      ],
      "TrackRefId": 10,
      "Description": "Dăm la o parte “cultura organizațională”, “motivarea”, “engagement-ul”, “spiritul de echipă”, “leadership-ul” și altele ca ele, și ne uităm direct în ochii monstrului: ce vedem?  O discuție despre părțile dureroase ale învățării, despre ceea ce ne schimbă cu adevărat, și despre cum trecem prin transformările care contează. Când învățarea încetează să mai fie jucărie și devine identitate. Când intrăm în acel joc în care avem multe de pierdut. Cum o facem? De ce lucruri are rost să ne temem, și de care nu?"
    },
    {
      "Id": 3001,
      "Start": "2015-11-07T06:00:00+0000",
      "End": "2015-11-07T06:45:00+0000",
      "OverrideTracks": true,
      "SpeakerRefIds": [],
      "TrackRefId": null,
      "Title": "Registration & Welcome coffee",
      "Description": ""
    },
    {
      "Id": 3002,
      "Start": "2015-11-07T06:45:00+0000",
      "End": "2015-11-07T08:30:00+0000",
      "OverrideTracks": true,
      "SpeakerRefIds": [],
      "TrackRefId": null,
      "Title": "Opening + Meet the sponsors",
      "Description": ""
    },
    {
      "Id": 3003,
      "Start": "2015-11-07T08:30:00+0000",
      "End": "2015-11-07T09:00:00+0000",
      "OverrideTracks": true,
      "SpeakerRefIds": [],
      "TrackRefId": null,
      "Title": "Break",
      "Description": ""
    },
    {
      "Id": 3004,
      "Start": "2015-11-07T10:45:00+0000",
      "End": "2015-11-07T11:00:00+0000",
      "OverrideTracks": true,
      "SpeakerRefIds": [],
      "TrackRefId": null,
      "Title": "Coffee Break",
      "Description": ""
    },
    {
      "Id": 3005,
      "Start": "2015-11-07T11:45:00+0000",
      "End": "2015-11-07T13:00:00+0000",
      "OverrideTracks": true,
      "SpeakerRefIds": [],
      "TrackRefId": null,
      "Title": "Lunch break in the restaurant",
      "Description": ""
    },
    {
      "Id": 3006,
      "Start": "2015-11-07T15:45:00+0000",
      "End": "2015-11-07T16:00:00+0000",
      "OverrideTracks": true,
      "SpeakerRefIds": [],
      "TrackRefId": null,
      "Title": "The Raffle: Come to Room 2 and Win Your Prizes!",
      "Description": ""
    }
  ]
}